[
    {
        "metadata_version": "2.4",
        "name": "ARParser",
        "version": "0.2",
        "summary": "Python library for the Android binary XML ( AXML ) file format.",
        "description": "<p align=\"center\">\n<a href=\"https://t.me/rktechnoindians\"><img title=\"Made in INDIA\" src=\"https://img.shields.io/badge/MADE%20IN-INDIA-SCRIPT?colorA=%23ff8100&colorB=%23017e40&colorC=%23ff0000&style=for-the-badge\"></a>\n</p>\n\n<a name=\"readme-top\"></a>\n\n\n# ARParser\n\n\n<p align=\"center\"> \n<a href=\"https://t.me/rktechnoindians\"><img src=\"https://readme-typing-svg.herokuapp.com?font=Fira+Code&weight=800&size=35&pause=1000&color=F74848&center=true&vCenter=true&random=false&width=435&lines=ARParser\" /></a>\n </p>\n \n# Androguard's axml\n\nThis is a library for handling the AXML file format.  \"AXML\" is the informal\ncommon name for the compiled binary XML data format used in Android app files.\nThe Android Open Source Project does not seem to have named the format, other\nthan referring to is as \"binary XML\" or \"compiled XML\".  So AXML stands for\nAndroid XML. The file format is based on compiling XML source into a binary\nformat based on [protobuf](). There are a number of different Android XML file\ntypes that are compiled to AXML, these are generically known as [Android\nResources](https://developer.android.com/guide/topics/resources/available-resources).\nAll of these files are included in the APK's ZIP package with the file extension\n`.xml` even though they are actually AXML and not XML.\n\nSome specific data files, like String Resources and Style Resources, are instead\ncompiled into a single file `resources.arsc` in its own data format, known as\nASRC.  AXML files often refer to values that are in `resources.arsc`.\n\nThe entry point for an app is the \"[app\nmanifest](https://developer.android.com/guide/topics/manifest/manifest-element)\"\ndefines the essential data points that every app must have, like Package Name\nand Version Code, and includes lots of other metadata that describe the\napp. Every Android app file (APK) must include\n[`AndroidManifest.xml`](https://developer.android.com/guide/topics/manifest/manifest-intro),\nwhich in the APK is the compiled binary AXML format, not XML, despite the file\nextension.  The source code files for the binary app manifest file are also\ncalled `AndroidManifest.xml`, but they are actually XML.  There can be\n[multiple](https://developer.android.com/build/manage-manifests) source files,\nbut there is only ever one single compiled binary `AndroidManifest.xml` that is\nvalid in the APK.\n\nhttps://developer.android.com/guide/topics/manifest/manifest-intro#reference\n\n\nInstallation Method\n-------\n**💢 Requirement PKG 💢**\n\n    termux-setup-storage && pkg update -y && pkg upgrade -y && pkg install python libxslt -y && pip install click pygments rich lxml\n\n**👉🏻 To install ARParser, Run only any one cmd from the Installation Method**\n\n**💢 PYPI ( Just Testing ) 💢**\n\n    pip install ARParser\n\n**1st. Method**\n\n`💢 For Latest Commit ( From Main  Branch )  💢`\n\n    pip install --force-reinstall https://github.com/TechnoIndian/ARParser/archive/refs/heads/main.zip\n\n`Or`\n\n    pip install --force-reinstall https://github.com/TechnoIndian/ARParser/archive/refs/heads/main.tar.gz\n\n`Or`\n\n    curl -Ls https://github.com/TechnoIndian/Tools/releases/download/Tools/ARParser.sh | bash\n\n**2nd. Method**\n\n    pkg install python git && pip install --force-reinstall git+https://github.com/TechnoIndian/ARParser.git\n\n\nUninstall ARParser\n-----\n\n    pip uninstall ARParser\n\n\nUsage\n-----\n\n#### AXMLPrinter\n\n**├➢ AXMLPrinter ( Support APK & XML )**\n\n    ARParser axml -i AndroidManifest.xml\n\n`Or`\n\n    ARParser axml AndroidManifest.xml\n\n`With APK`\n\n    ARParser axml Apk_Path.apk\n    \n**├➢ ID2Name, Default is ID ( @7F140004 𒁍 @xml/network_security_config | _attr_01010003 𒁍 android:name )**\n\n    ARParser axml Apk_Path.apk -n\n\n**├➢ ResParser ( Res AXML Parse )**\n\n    ARParser axml Apk_Path.apk -r res/xml/xyz.xml\n\n`ID2Name`\n\n    ARParser axml Apk_Path.apk -r res/xml/xyz.xml -n\n\n**Mode Help ( --help )**\n\n    ARParser axml --help \n\n#### ARSCParser\n\n**├➢ Public XML ( Default )**\n\n    ARParser arsc Apk_Path.apk\n\n**├➢ hex ID ( Resolve 𒁍 locale and package )**\n\n    ARParser arsc Apk_Path.apk -id 7f060008\n\n**├➢ Locale ( en-rIN, en-rGB, zh-rCN etc. )**\n\n    ARParser arsc Apk_Path.apk -l en-rIN\n\n**├➢ Type [string|strings|bool|id|color|dimen|integer|public]**\n\n    ARParser arsc Apk_Path.apk -t string\n\n**Mode Help ( --help )**\n\n    ARParser arsc --help \n\n\n## Current status\n\n - Passing androguard tests for axml and arsc.\n\n#### Structure\n\n~~~~\naxml/\n├── axml/\n│   ├── __init__.py       # Expose the public API (parse_axml, AXMLParser, AXMLPrinter)\n│   ├── apk.py            # input APK_Path.apk, AndroidManifest.xml, resources.arsc\n│   ├── cli.py            # Command Helper\n│   ├── main.py           # Script Execution \n│   ├── constants.py      # All constants (chunk types, flag values...)\n│   ├── exceptions.py     # Custom exceptions (like ResParserError)\n│   ├── stringblock.py    # The StringBlock class and its helper functions (_decode8, _decode16...)\n│   ├── parser_arsc.py    # The resources parser class and related parsing functions\n│   ├── parser_axml.py    # The AXMLParser class and related parsing functions\n│   ├── printer.py        # The AXMLPrinter class for converting parsed AXML into an ElementTree\n│   └── formatters.py     # Helper functions like format_value and any formatting utilities\n│   ├── resources\n│   │   ├── __init__.py\n│   │   ├── public.json\n│   │   ├── public.py\n│   │   └── public.xml\n├── tests/\n│   └── test_*.py    # Unit tests for each module\n├── setup.py              # Packaging file\n├── pyproject.toml        # Build configuration\n└── README.md             # Project description and usage instructions\n~~~~\n\n### Goals\n\n - Write tests early approach, so we can immediately verify breaking changes.\n - Expose a clean public API\n - Standalone capabilities for axml parsing\n - Provide basic documentation\n\n\n### Coding style\n\n - Follow [PEP 257](https://peps.python.org/pep-0257/) guidelines using the reStructuredText (reST) format for all docstrings.\n\n## AXML binary format\n\nSome references about the binary AXML format:\n\n* [_aapt2_](https://developer.android.com/tools/aapt2) compiles XML to protobuf-based AXML\n* [_aapt2_ source code](https://android.googlesource.com/platform/frameworks/base/+/master/tools/aapt2)\n* [_aapt_ source code](https://android.googlesource.com/platform/frameworks/base/+/master/tools/aapt)\n* The binary format for `AndroidManifest.xml` is defined in [`ApkInfo.proto`](https://android.googlesource.com/platform/frameworks/base/+/refs/heads/main/tools/aapt2/ApkInfo.proto).\n\n![Android binary XML](https://raw.githubusercontent.com/senswrong/AndroidBinaryXml/main/AndroidBinaryXml.png)\n\n<!-- back up URL in case the one above goes away\n![Android binary XML](https://github.com/user-attachments/assets/6439a13a-5a50-4f32-b106-c70c9fb9acf1)\n-->\n\n\n## 🇮🇳 Welcome By Techno India 🇮🇳\n\n**Credit**\n\n* [_axml_](https://github.com/androguard/axml) compiles XML to protobuf-based AXML\n* [_androguard_](https://github.com/androguard/androguard) compiles XML to protobuf-based AXML\n\n[![Telegram](https://img.shields.io/badge/TELEGRAM-CHANNEL-red?style=for-the-badge&logo=telegram)](https://t.me/rktechnoindians)\n  </a><p>\n[![Telegram](https://img.shields.io/badge/TELEGRAM-OWNER-red?style=for-the-badge&logo=telegram)](https://t.me/RK_TECHNO_INDIA)\n</p>\n",
        "description_content_type": "text/markdown",
        "license": "Apache License\n                                   Version 2.0, January 2004\n                                http://www.apache.org/licenses/\n        \n           TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n        \n           1. Definitions.\n        \n              \"License\" shall mean the terms and conditions for use, reproduction,\n              and distribution as defined by Sections 1 through 9 of this document.\n        \n              \"Licensor\" shall mean the copyright owner or entity authorized by\n              the copyright owner that is granting the License.\n        \n              \"Legal Entity\" shall mean the union of the acting entity and all\n              other entities that control, are controlled by, or are under common\n              control with that entity. For the purposes of this definition,\n              \"control\" means (i) the power, direct or indirect, to cause the\n              direction or management of such entity, whether by contract or\n              otherwise, or (ii) ownership of fifty percent (50%) or more of the\n              outstanding shares, or (iii) beneficial ownership of such entity.\n        \n              \"You\" (or \"Your\") shall mean an individual or Legal Entity\n              exercising permissions granted by this License.\n        \n              \"Source\" form shall mean the preferred form for making modifications,\n              including but not limited to software source code, documentation\n              source, and configuration files.\n        \n              \"Object\" form shall mean any form resulting from mechanical\n              transformation or translation of a Source form, including but\n              not limited to compiled object code, generated documentation,\n              and conversions to other media types.\n        \n              \"Work\" shall mean the work of authorship, whether in Source or\n              Object form, made available under the License, as indicated by a\n              copyright notice that is included in or attached to the work\n              (an example is provided in the Appendix below).\n        \n              \"Derivative Works\" shall mean any work, whether in Source or Object\n              form, that is based on (or derived from) the Work and for which the\n              editorial revisions, annotations, elaborations, or other modifications\n              represent, as a whole, an original work of authorship. For the purposes\n              of this License, Derivative Works shall not include works that remain\n              separable from, or merely link (or bind by name) to the interfaces of,\n              the Work and Derivative Works thereof.\n        \n              \"Contribution\" shall mean any work of authorship, including\n              the original version of the Work and any modifications or additions\n              to that Work or Derivative Works thereof, that is intentionally\n              submitted to Licensor for inclusion in the Work by the copyright owner\n              or by an individual or Legal Entity authorized to submit on behalf of\n              the copyright owner. For the purposes of this definition, \"submitted\"\n              means any form of electronic, verbal, or written communication sent\n              to the Licensor or its representatives, including but not limited to\n              communication on electronic mailing lists, source code control systems,\n              and issue tracking systems that are managed by, or on behalf of, the\n              Licensor for the purpose of discussing and improving the Work, but\n              excluding communication that is conspicuously marked or otherwise\n              designated in writing by the copyright owner as \"Not a Contribution.\"\n        \n              \"Contributor\" shall mean Licensor and any individual or Legal Entity\n              on behalf of whom a Contribution has been received by Licensor and\n              subsequently incorporated within the Work.\n        \n           2. Grant of Copyright License. Subject to the terms and conditions of\n              this License, each Contributor hereby grants to You a perpetual,\n              worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n              copyright license to reproduce, prepare Derivative Works of,\n              publicly display, publicly perform, sublicense, and distribute the\n              Work and such Derivative Works in Source or Object form.\n        \n           3. Grant of Patent License. Subject to the terms and conditions of\n              this License, each Contributor hereby grants to You a perpetual,\n              worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n              (except as stated in this section) patent license to make, have made,\n              use, offer to sell, sell, import, and otherwise transfer the Work,\n              where such license applies only to those patent claims licensable\n              by such Contributor that are necessarily infringed by their\n              Contribution(s) alone or by combination of their Contribution(s)\n              with the Work to which such Contribution(s) was submitted. If You\n              institute patent litigation against any entity (including a\n              cross-claim or counterclaim in a lawsuit) alleging that the Work\n              or a Contribution incorporated within the Work constitutes direct\n              or contributory patent infringement, then any patent licenses\n              granted to You under this License for that Work shall terminate\n              as of the date such litigation is filed.\n        \n           4. Redistribution. You may reproduce and distribute copies of the\n              Work or Derivative Works thereof in any medium, with or without\n              modifications, and in Source or Object form, provided that You\n              meet the following conditions:\n        \n              (a) You must give any other recipients of the Work or\n                  Derivative Works a copy of this License; and\n        \n              (b) You must cause any modified files to carry prominent notices\n                  stating that You changed the files; and\n        \n              (c) You must retain, in the Source form of any Derivative Works\n                  that You distribute, all copyright, patent, trademark, and\n                  attribution notices from the Source form of the Work,\n                  excluding those notices that do not pertain to any part of\n                  the Derivative Works; and\n        \n              (d) If the Work includes a \"NOTICE\" text file as part of its\n                  distribution, then any Derivative Works that You distribute must\n                  include a readable copy of the attribution notices contained\n                  within such NOTICE file, excluding those notices that do not\n                  pertain to any part of the Derivative Works, in at least one\n                  of the following places: within a NOTICE text file distributed\n                  as part of the Derivative Works; within the Source form or\n                  documentation, if provided along with the Derivative Works; or,\n                  within a display generated by the Derivative Works, if and\n                  wherever such third-party notices normally appear. The contents\n                  of the NOTICE file are for informational purposes only and\n                  do not modify the License. You may add Your own attribution\n                  notices within Derivative Works that You distribute, alongside\n                  or as an addendum to the NOTICE text from the Work, provided\n                  that such additional attribution notices cannot be construed\n                  as modifying the License.\n        \n              You may add Your own copyright statement to Your modifications and\n              may provide additional or different license terms and conditions\n              for use, reproduction, or distribution of Your modifications, or\n              for any such Derivative Works as a whole, provided Your use,\n              reproduction, and distribution of the Work otherwise complies with\n              the conditions stated in this License.\n        \n           5. Submission of Contributions. Unless You explicitly state otherwise,\n              any Contribution intentionally submitted for inclusion in the Work\n              by You to the Licensor shall be under the terms and conditions of\n              this License, without any additional terms or conditions.\n              Notwithstanding the above, nothing herein shall supersede or modify\n              the terms of any separate license agreement you may have executed\n              with Licensor regarding such Contributions.\n        \n           6. Trademarks. This License does not grant permission to use the trade\n              names, trademarks, service marks, or product names of the Licensor,\n              except as required for reasonable and customary use in describing the\n              origin of the Work and reproducing the content of the NOTICE file.\n        \n           7. Disclaimer of Warranty. Unless required by applicable law or\n              agreed to in writing, Licensor provides the Work (and each\n              Contributor provides its Contributions) on an \"AS IS\" BASIS,\n              WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n              implied, including, without limitation, any warranties or conditions\n              of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n              PARTICULAR PURPOSE. You are solely responsible for determining the\n              appropriateness of using or redistributing the Work and assume any\n              risks associated with Your exercise of permissions under this License.\n        \n           8. Limitation of Liability. In no event and under no legal theory,\n              whether in tort (including negligence), contract, or otherwise,\n              unless required by applicable law (such as deliberate and grossly\n              negligent acts) or agreed to in writing, shall any Contributor be\n              liable to You for damages, including any direct, indirect, special,\n              incidental, or consequential damages of any character arising as a\n              result of this License or out of the use or inability to use the\n              Work (including but not limited to damages for loss of goodwill,\n              work stoppage, computer failure or malfunction, or any and all\n              other commercial damages or losses), even if such Contributor\n              has been advised of the possibility of such damages.\n        \n           9. Accepting Warranty or Additional Liability. While redistributing\n              the Work or Derivative Works thereof, You may choose to offer,\n              and charge a fee for, acceptance of support, warranty, indemnity,\n              or other liability obligations and/or rights consistent with this\n              License. However, in accepting such obligations, You may act only\n              on Your own behalf and on Your sole responsibility, not on behalf\n              of any other Contributor, and only if You agree to indemnify,\n              defend, and hold each Contributor harmless for any liability\n              incurred by, or claims asserted against, such Contributor by reason\n              of your accepting any such warranty or additional liability.\n        \n           END OF TERMS AND CONDITIONS\n        \n           APPENDIX: How to apply the Apache License to your work.\n        \n              To apply the Apache License to your work, attach the following\n              boilerplate notice, with the fields enclosed by brackets \"[]\"\n              replaced with your own identifying information. (Don't include\n              the brackets!)  The text should be enclosed in the appropriate\n              comment syntax for the file format. We also recommend that a\n              file or class name and description of purpose be included on the\n              same \"printed page\" as the copyright notice for easier\n              identification within third-party archives.\n        \n           Copyright [yyyy] [name of copyright owner]\n        \n           Licensed under the Apache License, Version 2.0 (the \"License\");\n           you may not use this file except in compliance with the License.\n           You may obtain a copy of the License at\n        \n               http://www.apache.org/licenses/LICENSE-2.0\n        \n           Unless required by applicable law or agreed to in writing, software\n           distributed under the License is distributed on an \"AS IS\" BASIS,\n           WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n           See the License for the specific language governing permissions and\n           limitations under the License.\n        ",
        "keywords": "ARParser",
        "classifiers": [
            "Development Status :: 5 - Production/Stable",
            "License :: OSI Approved :: Apache Software License",
            "Programming Language :: Python",
            "Programming Language :: Python :: 3",
            "Programming Language :: Python :: 3 :: Only",
            "Programming Language :: Python :: 3.9",
            "Programming Language :: Python :: 3.10",
            "Programming Language :: Python :: 3.11",
            "Programming Language :: Python :: 3.12",
            "Programming Language :: Python :: 3.13",
            "Topic :: Security",
            "Topic :: Software Development",
            "Topic :: Utilities"
        ],
        "platform": [],
        "requires_python": ">=3.9",
        "requires": [],
        "provides": [],
        "obsoletes": [],
        "requires_dist": [
            "click",
            "pygments",
            "rich>=14.0.0",
            "lxml>=4.3.0"
        ],
        "provides_dist": [],
        "obsoletes_dist": [],
        "requires_external": [],
        "project_urls": [
            "Homepage, https://github.com/TechnoIndian/ARParser",
            "Repository, https://github.com/TechnoIndian/ARParser.git",
            "Issues, https://github.com/TechnoIndian/ARParser/issues"
        ],
        "uploaded_via": "twine/6.1.0 CPython/3.12.11",
        "upload_time": "2025-08-01 18:20:21.741077 UTC",
        "filename": "arparser-0.2.tar.gz",
        "size": "103416",
        "path": "49/a6/b9a53a45c0fdeefe3fdcce03ebb832aa19851c7360917c1a25c491d853a9/arparser-0.2.tar.gz",
        "python_version": "source",
        "packagetype": "sdist",
        "has_signature": false,
        "md5_digest": "4f2426fd46ff0d99a9dbe7f62d2bf835",
        "sha256_digest": "5cd66228618ebac89a940977895e1a366a349a9081c75efe905433f78f9b90e5",
        "blake2_256_digest": "49a6b9a53a45c0fdeefe3fdcce03ebb832aa19851c7360917c1a25c491d853a9",
        "license_files": [
            "LICENSE"
        ],
        "rn": "1",
        "home_page": null,
        "download_url": null
    },
    {
        "metadata_version": "2.1",
        "name": "ArpSpoof",
        "version": "1.1.2",
        "summary": "This package implements an ARP Spoofer for MIM (Man-In-the-Middle) or DoS (Denial of Service) attacks.",
        "description": "![ArpSpoof logo](https://mauricelambert.github.io/info/python/security/ArpSpoof_small.png \"ArpSpoof logo\")\n\n# ArpSpoof\n\n## Description\n\nThis package implements an ARP Spoofer for MIM (Man-In-the-Middle) or DoS (Denial of Service) attacks.\n\n## Requirements\n\nThis package require:\n - python3\n - python3 Standard Library\n - Scapy\n - PythonToolsKit\n\n## Installation\n\n```bash\npip install ArpSpoof\n```\n\n## Usages\n\n### Command lines\n\n```bash\npython3 -m ArpSpoof -h                    # Use python module\npython3 ArpSpoof.pyz --help               # Use python executable\n\nArpSpoof 127.0.0.1 127.0.0.2              # Use console script entry point\nArpSpoof -v 127.0.0.1 127.0.0.2,127.0.0.5 # Spoof multiple targets (verbose mode)\nArpSpoof 127.0.0.1 127.0.0.2-127.0.0.5    # Spoof range of targets\nArpSpoof 127.0.0.1 127.0.0.0/29           # Spoof all network\n\nArpSpoof 127.0.0.1 127.0.0.0/29 -s -t 1   # Semi (spoof only gateway IP for the targets, interval is 1 seconds)\nArpSpoof 127.0.0.1 127.0.0.0/29 -i 127.0. # Use the loopback interface\n\nArpSpoof 172.16.10.1 172.16.0.33 -p       # Passive mode\n```\n\n### Python3\n\n```python\nfrom ArpSpoof import SpooferARP\n\nspoofer = SpooferARP('172.16.10.1', '172.16.0.35')\nspoofer.active_cache_poisonning()\n\nspoofer = SpooferARP('172.16.10.1', '172.16.0.35', conf.iface, False, 0.5)\nspoofer.passive_cache_poisonning(asynchronous=True)\nspoofer.run = False\nspoofer.sniffer.stop()                                   # only with asynchronous mode\nspoofer.restore()                                        # only with asynchronous mode\n\n# Multiple targets\nspoofer = SpooferARP('127.0.0.1', '127.0.0.2,127.0.0.3') # Spoof multiple targets\nspoofer = SpooferARP('127.0.0.1', '127.0.0.2-127.0.0.5') # Spoof range of targets\nspoofer = SpooferARP('127.0.0.1', '127.0.0.0/30')        # Spoof all network\n```\n\n## Links\n\n - [Github Page](https://github.com/mauricelambert/ArpSpoof)\n - [Pypi](https://pypi.org/project/ArpSpoof/)\n - [Documentation](https://mauricelambert.github.io/info/python/security/ArpSpoof.html)\n - [Executable](https://mauricelambert.github.io/info/python/security/ArpSpoof.pyz)\n\n## Help\n\n```text\nusage: ArpSpoof.py [-h] [--verbose] [--interface INTERFACE] [--time TIME] [--semi] [--passive] gateway target\n\npositional arguments:\n  gateway               Gateway IP or hostname\n  target                Target IP or hostname\n\noptional arguments:\n  -h, --help            show this help message and exit\n  --verbose, -v         Mode verbose (print debug message)\n  --interface INTERFACE, -i INTERFACE\n                        Part of the IP, MAC or name of the interface\n  --time TIME, -t TIME  Time in seconds to sleep between sending ARP packets.\n  --semi, -s            Spoof IP of the gateway (target will lost internet connection).\n  --passive, -p         Passive mode (response to ARP request only)\n```\n\n## Licence\n\nLicensed under the [GPL, version 3](https://www.gnu.org/licenses/).\n\n",
        "description_content_type": "text/markdown",
        "license": "GPL-3.0 License",
        "keywords": "ARP,arpcachepoisonning,arpcachepoison,network,ManInTheMiddle,MIM,Security,DoS,DenialOfService",
        "classifiers": [
            "Programming Language :: Python",
            "Development Status :: 5 - Production/Stable",
            "Topic :: System :: Networking",
            "Topic :: Security",
            "Natural Language :: English",
            "Programming Language :: Python :: 3.9",
            "Operating System :: POSIX :: Linux",
            "Operating System :: Microsoft :: Windows",
            "Operating System :: MacOS"
        ],
        "platform": [
            "Windows"
        ],
        "requires_python": ">=3.6",
        "requires": [],
        "provides": [],
        "obsoletes": [],
        "requires_dist": [],
        "provides_dist": [],
        "obsoletes_dist": [],
        "requires_external": [],
        "project_urls": [
            "Documentation, https://mauricelambert.github.io/info/python/security/ArpSpoof.html",
            "Executable, https://mauricelambert.github.io/info/python/security/ArpSpoof.pyz"
        ],
        "uploaded_via": "twine/3.2.0 pkginfo/1.6.1 requests/2.25.0 setuptools/59.6.0 requests-toolbelt/0.9.1 tqdm/4.54.1 CPython/3.9.10",
        "upload_time": "2022-03-14 06:59:52.434464 UTC",
        "filename": "ArpSpoof-1.1.2.tar.gz",
        "size": "21195",
        "path": "98/c7/49fa5021084dd81aaf37b3a697e5cc19fdc63c7fe7b5ddc2ff0149359bde/ArpSpoof-1.1.2.tar.gz",
        "python_version": "source",
        "packagetype": "sdist",
        "has_signature": false,
        "md5_digest": "6d5a222221508aca47d082463e6ec6a7",
        "sha256_digest": "d28d6b9b9cf88232758d8b3f94c3282aade8c29bbdc5001d4827447cee7a4faf",
        "blake2_256_digest": "98c749fa5021084dd81aaf37b3a697e5cc19fdc63c7fe7b5ddc2ff0149359bde",
        "license_files": [],
        "rn": "1",
        "home_page": "https://github.com/mauricelambert/ArpSpoof",
        "download_url": null
    },
    {
        "metadata_version": "2.4",
        "name": "Authlib",
        "version": "1.6.5",
        "summary": "The ultimate Python library in building OAuth and OpenID Connect servers and clients.",
        "description": "<div align=\"center\">\n\n<picture>\n  <source media=\"(prefers-color-scheme: dark)\" srcset=\"docs/_static/dark-logo.svg\" />\n  <img alt=\"Authlib\" src=\"docs/_static/light-logo.svg\" height=\"68\" />\n</picture>\n\n[![Build Status](https://github.com/authlib/authlib/workflows/tests/badge.svg)](https://github.com/authlib/authlib/actions)\n[![PyPI version](https://img.shields.io/pypi/v/authlib.svg)](https://pypi.org/project/authlib)\n[![conda-forge version](https://img.shields.io/conda/v/conda-forge/authlib.svg?label=conda-forge&colorB=0090ff)](https://anaconda.org/conda-forge/authlib)\n[![PyPI Downloads](https://static.pepy.tech/badge/authlib/month)](https://pepy.tech/projects/authlib)\n[![Code Coverage](https://codecov.io/gh/authlib/authlib/graph/badge.svg?token=OWTdxAIsPI)](https://codecov.io/gh/authlib/authlib)\n[![Maintainability Rating](https://sonarcloud.io/api/project_badges/measure?project=authlib_authlib&metric=sqale_rating)](https://sonarcloud.io/summary/new_code?id=authlib_authlib)\n\n</div>\n\nThe ultimate Python library in building OAuth and OpenID Connect servers.\nJWS, JWK, JWA, JWT are included.\n\nAuthlib is compatible with Python3.9+.\n\n## Migrations\n\nAuthlib will deprecate `authlib.jose` module, please read:\n\n- [Migrating from `authlib.jose` to `joserfc`](https://jose.authlib.org/en/dev/migrations/authlib/)\n\n## Sponsors\n\n<table>\n<tr>\n<td><img align=\"middle\" width=\"48\" src=\"https://cdn.auth0.com/website/website/favicons/auth0-favicon.svg\"></td>\n<td>If you want to quickly add secure token-based authentication to Python projects, feel free to check Auth0's Python SDK and free plan at <a href=\"https://auth0.com/overview?utm_source=GHsponsor&utm_medium=GHsponsor&utm_campaign=authlib&utm_content=auth\">auth0.com/overview</a>.</td>\n</tr>\n<tr>\n<td><img align=\"middle\" width=\"48\" src=\"https://typlog.com/assets/icon-white.svg\"></td>\n<td>A blogging and podcast hosting platform with minimal design but powerful features. Host your blog and Podcast with <a href=\"https://typlog.com/\">Typlog.com</a>.\n</td>\n</tr>\n</table>\n\n[**Fund Authlib to access additional features**](https://docs.authlib.org/en/latest/community/funding.html)\n\n## Features\n\nGeneric, spec-compliant implementation to build clients and providers:\n\n- [The OAuth 1.0 Protocol](https://docs.authlib.org/en/latest/basic/oauth1.html)\n  - [RFC5849: The OAuth 1.0 Protocol](https://docs.authlib.org/en/latest/specs/rfc5849.html)\n- [The OAuth 2.0 Authorization Framework](https://docs.authlib.org/en/latest/basic/oauth2.html)\n  - [RFC6749: The OAuth 2.0 Authorization Framework](https://docs.authlib.org/en/latest/specs/rfc6749.html)\n  - [RFC6750: The OAuth 2.0 Authorization Framework: Bearer Token Usage](https://docs.authlib.org/en/latest/specs/rfc6750.html)\n  - [RFC7009: OAuth 2.0 Token Revocation](https://docs.authlib.org/en/latest/specs/rfc7009.html)\n  - [RFC7523: JWT Profile for OAuth 2.0 Client Authentication and Authorization Grants](https://docs.authlib.org/en/latest/specs/rfc7523.html)\n  - [RFC7591: OAuth 2.0 Dynamic Client Registration Protocol](https://docs.authlib.org/en/latest/specs/rfc7591.html)\n  - [RFC7592: OAuth 2.0 Dynamic Client Registration Management Protocol](https://docs.authlib.org/en/latest/specs/rfc7592.html)\n  - [RFC7636: Proof Key for Code Exchange by OAuth Public Clients](https://docs.authlib.org/en/latest/specs/rfc7636.html)\n  - [RFC7662: OAuth 2.0 Token Introspection](https://docs.authlib.org/en/latest/specs/rfc7662.html)\n  - [RFC8414: OAuth 2.0 Authorization Server Metadata](https://docs.authlib.org/en/latest/specs/rfc8414.html)\n  - [RFC8628: OAuth 2.0 Device Authorization Grant](https://docs.authlib.org/en/latest/specs/rfc8628.html)\n  - [RFC9068: JSON Web Token (JWT) Profile for OAuth 2.0 Access Tokens](https://docs.authlib.org/en/latest/specs/rfc9068.html)\n  - [RFC9101: The OAuth 2.0 Authorization Framework: JWT-Secured Authorization Request (JAR)](https://docs.authlib.org/en/latest/specs/rfc9101.html)\n  - [RFC9207: OAuth 2.0 Authorization Server Issuer Identification](https://docs.authlib.org/en/latest/specs/rfc9207.html)\n- [Javascript Object Signing and Encryption](https://docs.authlib.org/en/latest/jose/index.html)\n  - [RFC7515: JSON Web Signature](https://docs.authlib.org/en/latest/jose/jws.html)\n  - [RFC7516: JSON Web Encryption](https://docs.authlib.org/en/latest/jose/jwe.html)\n  - [RFC7517: JSON Web Key](https://docs.authlib.org/en/latest/jose/jwk.html)\n  - [RFC7518: JSON Web Algorithms](https://docs.authlib.org/en/latest/specs/rfc7518.html)\n  - [RFC7519: JSON Web Token](https://docs.authlib.org/en/latest/jose/jwt.html)\n  - [RFC7638: JSON Web Key (JWK) Thumbprint](https://docs.authlib.org/en/latest/specs/rfc7638.html)\n  - [ ] RFC7797: JSON Web Signature (JWS) Unencoded Payload Option\n  - [RFC8037: ECDH in JWS and JWE](https://docs.authlib.org/en/latest/specs/rfc8037.html)\n  - [ ] draft-madden-jose-ecdh-1pu-04: Public Key Authenticated Encryption for JOSE: ECDH-1PU\n- [OpenID Connect 1.0](https://docs.authlib.org/en/latest/specs/oidc.html)\n  - [x] OpenID Connect Core 1.0\n  - [x] OpenID Connect Discovery 1.0\n  - [x] OpenID Connect Dynamic Client Registration 1.0\n\nConnect third party OAuth providers with Authlib built-in client integrations:\n\n- Requests\n  - [OAuth1Session](https://docs.authlib.org/en/latest/client/requests.html#requests-oauth-1-0)\n  - [OAuth2Session](https://docs.authlib.org/en/latest/client/requests.html#requests-oauth-2-0)\n  - [OpenID Connect](https://docs.authlib.org/en/latest/client/requests.html#requests-openid-connect)\n  - [AssertionSession](https://docs.authlib.org/en/latest/client/requests.html#requests-service-account)\n- HTTPX\n  - [AsyncOAuth1Client](https://docs.authlib.org/en/latest/client/httpx.html#httpx-oauth-1-0)\n  - [AsyncOAuth2Client](https://docs.authlib.org/en/latest/client/httpx.html#httpx-oauth-2-0)\n  - [OpenID Connect](https://docs.authlib.org/en/latest/client/httpx.html#httpx-oauth-2-0)\n  - [AsyncAssertionClient](https://docs.authlib.org/en/latest/client/httpx.html#async-service-account)\n- [Flask OAuth Client](https://docs.authlib.org/en/latest/client/flask.html)\n- [Django OAuth Client](https://docs.authlib.org/en/latest/client/django.html)\n- [Starlette OAuth Client](https://docs.authlib.org/en/latest/client/starlette.html)\n- [FastAPI OAuth Client](https://docs.authlib.org/en/latest/client/fastapi.html)\n\nBuild your own OAuth 1.0, OAuth 2.0, and OpenID Connect providers:\n\n- Flask\n  - [Flask OAuth 1.0 Provider](https://docs.authlib.org/en/latest/flask/1/)\n  - [Flask OAuth 2.0 Provider](https://docs.authlib.org/en/latest/flask/2/)\n  - [Flask OpenID Connect 1.0 Provider](https://docs.authlib.org/en/latest/flask/2/openid-connect.html)\n- Django\n  - [Django OAuth 1.0 Provider](https://docs.authlib.org/en/latest/django/1/)\n  - [Django OAuth 2.0 Provider](https://docs.authlib.org/en/latest/django/2/)\n  - [Django OpenID Connect 1.0 Provider](https://docs.authlib.org/en/latest/django/2/openid-connect.html)\n\n## Useful Links\n\n1. Homepage: <https://authlib.org/>.\n2. Documentation: <https://docs.authlib.org/>.\n3. Purchase Commercial License: <https://authlib.org/plans>.\n4. Blog: <https://blog.authlib.org/>.\n5. Twitter: <https://twitter.com/authlib>.\n6. StackOverflow: <https://stackoverflow.com/questions/tagged/authlib>.\n7. Other Repositories: <https://github.com/authlib>.\n8. Subscribe Tidelift: [https://tidelift.com/subscription/pkg/pypi-authlib](https://tidelift.com/subscription/pkg/pypi-authlib?utm_source=pypi-authlib&utm_medium=referral&utm_campaign=links).\n\n## Security Reporting\n\nIf you found security bugs, please do not send a public issue or patch.\nYou can send me email at <me@lepture.com>. Attachment with patch is welcome.\nMy PGP Key fingerprint is:\n\n```\n72F8 E895 A70C EBDF 4F2A DFE0 7E55 E3E0 118B 2B4C\n```\n\nOr, you can use the [Tidelift security contact](https://tidelift.com/security).\nTidelift will coordinate the fix and disclosure.\n\n## License\n\nAuthlib offers two licenses:\n\n1. BSD LICENSE\n2. COMMERCIAL-LICENSE\n\nAny project, open or closed source, can use the BSD license.\nIf your company needs commercial support, you can purchase a commercial license at\n[Authlib Plans](https://authlib.org/plans). You can find more information at\n<https://authlib.org/support>.\n",
        "description_content_type": "text/markdown",
        "license": "BSD-3-Clause",
        "keywords": null,
        "classifiers": [
            "Development Status :: 5 - Production/Stable",
            "Environment :: Console",
            "Environment :: Web Environment",
            "Intended Audience :: Developers",
            "License :: OSI Approved :: BSD License",
            "Operating System :: OS Independent",
            "Programming Language :: Python",
            "Programming Language :: Python :: 3",
            "Programming Language :: Python :: 3.9",
            "Programming Language :: Python :: 3.10",
            "Programming Language :: Python :: 3.11",
            "Programming Language :: Python :: 3.12",
            "Programming Language :: Python :: 3.13",
            "Programming Language :: Python :: Implementation :: CPython",
            "Programming Language :: Python :: Implementation :: PyPy",
            "Topic :: Security",
            "Topic :: Security :: Cryptography",
            "Topic :: Internet :: WWW/HTTP :: Dynamic Content",
            "Topic :: Internet :: WWW/HTTP :: WSGI :: Application"
        ],
        "platform": [],
        "requires_python": ">=3.9",
        "requires": [],
        "provides": [],
        "obsoletes": [],
        "requires_dist": [
            "cryptography"
        ],
        "provides_dist": [],
        "obsoletes_dist": [],
        "requires_external": [],
        "project_urls": [
            "Documentation, https://docs.authlib.org/",
            "Purchase, https://authlib.org/plans",
            "Issues, https://github.com/authlib/authlib/issues",
            "Source, https://github.com/authlib/authlib",
            "Donate, https://github.com/sponsors/lepture",
            "Blog, https://blog.authlib.org/"
        ],
        "uploaded_via": "twine/6.1.0 CPython/3.13.7",
        "upload_time": "2025-10-02 13:36:09.489272 UTC",
        "filename": "authlib-1.6.5.tar.gz",
        "size": "164553",
        "path": "cd/3f/1d3bbd0bf23bdd99276d4def22f29c27a914067b4cf66f753ff9b8bbd0f3/authlib-1.6.5.tar.gz",
        "python_version": "source",
        "packagetype": "sdist",
        "has_signature": false,
        "md5_digest": "8c863355ddaef5753b85b48498c5212a",
        "sha256_digest": "6aaf9c79b7cc96c900f0b284061691c5d4e61221640a948fe690b556a6d6d10b",
        "blake2_256_digest": "cd3f1d3bbd0bf23bdd99276d4def22f29c27a914067b4cf66f753ff9b8bbd0f3",
        "license_files": [
            "LICENSE"
        ],
        "rn": "1",
        "home_page": null,
        "download_url": null
    },
    {
        "metadata_version": "2.2",
        "name": "BinaryFileReader",
        "version": "3.0.4",
        "summary": "This package reads binary file to exports strings or prints content as hexadecimal.",
        "description": "![BinaryFileReader Logo](https://mauricelambert.github.io/info/python/security/BinaryFileReader/small.png \"BinaryFileReader logo\")\n\n# BinaryFileReader\n\n## Description\n\nThis package reads binary file to exports strings or prints content as hexadecimal.\n\n> By default the `Strings` command print only null terminated strings (*unicode (Windows, utf-16-le)* and ascii *(Linux, latin-1)*) and support non-null termined strings with option `-t`.\n> `HexaReader` is colored and support custom coloration.\n> `MagicStrings` can extract strings and analyze it, to decode it, to decrypt it and find the format (like IP, fqdn, file path, ...).\n\n## Requirements\n\nThis package require:\n\n - python3\n - python3 Standard Library\n - PythonToolsKit==1.2.4\n - PegParser==1.1.3\n - RC4Encryption==0.0.2\n - RC6Encryption==1.0.1\n\n## Installation\n\n### Pip\n\n```bash\npip install BinaryFileReader\n```\n\n### Git\n\n```bash\ngit clone \"https://github.com/mauricelambert/BinaryFileReader.git\"\ncd \"BinaryFileReader\"\npython3 -m pip install .\n```\n\n### Wget\n\n```bash\nwget https://github.com/mauricelambert/BinaryFileReader/archive/refs/heads/main.zip\nunzip main.zip\ncd BinaryFileReader-main\npython3 -m pip install .\n```\n\n### cURL\n\n```bash\ncurl -O https://github.com/mauricelambert/BinaryFileReader/archive/refs/heads/main.zip\nunzip main.zip\ncd BinaryFileReader-main\npython3 -m pip install .\n```\n\n## Usages\n\n## Command line\n\n```bash\nStrings                                  # Using CLI package executable\nHexaReader                               # Using CLI package executable\nMagicStrings                             # Using CLI package executable\nBinaryFileReader strings                 # Using CLI package executable\nBinaryFileReader hexareader              # Using CLI package executable\nBinaryFileReader magic                   # Using CLI package executable\npython3 -m BinaryFileReader strings      # Using python module\npython3 -m BinaryFileReader.Strings      # Using python module\npython3 -m BinaryFileReader hexareader   # Using python module\npython3 -m BinaryFileReader.HexaReader   # Using python module\npython3 -m BinaryFileReader magic        # Using python module\npython3 -m BinaryFileReader.MagicStrings # Using python module\npython3 BinaryFileReader.pyz strings     # Using python executable\npython3 BinaryFileReader.pyz hexareader  # Using python executable\npython3 BinaryFileReader.pyz magic       # Using python executable\npython3 Strings.pyz                      # Using python executable\npython3 HexaReader.pyz                   # Using python executable\npython3 MagicStrings.pyz                 # Using python executable\nStrings.exe                              # Using python Windows executable\nHexaReader.exe                           # Using python Windows executable\nMagicStrings.exe                         # Using python Windows executable\nBinaryFileReader.exe strings             # Using python Windows executable\nBinaryFileReader.exe hexareader          # Using python Windows executable\nBinaryFileReader.exe magic               # Using python Windows executable\n\nStrings -h                               # get help message\nStrings test.bin                         # exports null terminated strings from test.bin\nStrings -n 7 -t test.dump                # exports strings with minimum length of 7 characters\nHexaReader test.bin                      # Read test.bin as hexadecimal and ascii printable\nHexaReader -c -s 25 test.bin             # Read test.bin as hexadecimal and ascii printable without colors and with 25 characters by line\nMagicStrings test.bin                    # exports, analyze, decode and decrypt null terminated strings and from test.bin\nMagicStrings -o fqdn -n 7 -t test.bin    # exports, analyze, decode and decrypt strings with minimum length of 7 characters but don't print fqdn found\nMagicStrings -i ipv4 -a -s test.bin      # exports, analyze, decode and decrypt null terminated strings using all formats (can take long time to run) but print only probable IPv4 true positive found\nMagicStrings -d ipv6 -s test.bin         # exports, analyze, decode and decrypt null terminated strings but don't identify IPv6 and print only probable true positive\nMagicStrings -p uri base64 -s test.bin   # exports, analyze, decode and decrypt null terminated strings but identify and process only base64 and URI and print only probable true positive\n```\n\n### Python script\n\n```python\nfrom BinaryFileReader import Strings, HexaReader, MagicStrings\n\nwith open(\"test.bin\", 'rb') as file:\n    hexareader = HexaReader(file)\n    for line in hexareader.reader():\n        print(line)\n\nwith open(\"test.bin\", 'rb') as file:\n    strings = Strings(file, minimum_length=5, null_terminated=True)\n    for line in strings.reader():\n        print(line)\n\nwith open(\"test.bin\", 'rb') as file:\n    magic = MagicStrings(file, minimum_length=5, null_terminated=True)\n    for line in magic.reader():\n        print(line)\n\nwith open(\"test.bin\", 'rb') as file:\n    hexa_reader = HexaReader(\n        file,\n        size=16,\n        ascii=True,\n        colors={  # color names can be found from PythonToolsKit.Terminal.COLORS (BLACK, RED, GREEN, YELLOW, BLUE, MAGENTA, CYAN, GRAY)\n            \"abcdefghijklmnopqrstuvwxyzABCDEFIJKLMNOPQRSTUVWXYZ\": \"GREEN\",\n            \"0123456789\": \"CYAN\",\n            \" !\\\"#$%&'()*+,-./:;<=>?[\\\\]^_{|}~`\": \"YELLOW\",\n        },\n    )\n    for line in hexareader.reader():\n        print(line)\n```\n\n## Links\n\n - [Pypi package](https://pypi.org/project/BinaryFileReader/)\n - [Github Page](https://github.com/mauricelambert/BinaryFileReader/)\n - [Strings Documentation](https://mauricelambert.github.io/info/python/security/BinaryFileReader/Strings.html)\n - [Strings Python executable](https://mauricelambert.github.io/info/python/security/BinaryFileReader/Strings.pyz)\n - [Strings Python Windows executable](https://mauricelambert.github.io/info/python/security/BinaryFileReader/Strings.exe)\n - [HexaReader Documentation](https://mauricelambert.github.io/info/python/security/BinaryFileReader/HexaReader.html)\n - [HexaReader Python executable](https://mauricelambert.github.io/info/python/security/BinaryFileReader/HexaReader.pyz)\n - [HexaReader Python Windows executable](https://mauricelambert.github.io/info/python/security/BinaryFileReader/HexaReader.exe)\n - [MagicStrings Documentation](https://mauricelambert.github.io/info/python/security/BinaryFileReader/MagicStrings.html)\n - [MagicStrings Python executable](https://mauricelambert.github.io/info/python/security/BinaryFileReader/MagicStrings.pyz)\n - [MagicStrings Python Windows executable](https://mauricelambert.github.io/info/python/security/BinaryFileReader/MagicStrings.exe)\n - [Python executable](https://mauricelambert.github.io/info/python/security/BinaryFileReader/BinaryFileReader.pyz)\n - [Python Windows executable](https://mauricelambert.github.io/info/python/security/BinaryFileReader/BinaryFileReader.exe)\n\n## Licence\n\nLicensed under the [GPL, version 3](https://www.gnu.org/licenses/).\n",
        "description_content_type": "text/markdown",
        "license": "GPL-3.0 License",
        "keywords": "strings, hexadecimal, hexadecimal-reader, binary-file, reverse, binary-reader, binary-viewer",
        "classifiers": [
            "Topic :: System",
            "Topic :: Security",
            "Environment :: Console",
            "Operating System :: MacOS",
            "Operating System :: POSIX",
            "Topic :: System :: Shells",
            "Natural Language :: English",
            "Programming Language :: Python",
            "Intended Audience :: Developers",
            "Topic :: System :: System Shells",
            "Operating System :: POSIX :: Linux",
            "Programming Language :: Python :: 3.8",
            "Operating System :: Microsoft :: Windows",
            "Topic :: System :: Systems Administration",
            "Intended Audience :: System Administrators",
            "Development Status :: 5 - Production/Stable",
            "License :: OSI Approved :: GNU General Public License v3 or later (GPLv3+)"
        ],
        "platform": [
            "Windows"
        ],
        "requires_python": ">=3.8",
        "requires": [],
        "provides": [],
        "obsoletes": [],
        "requires_dist": [
            "PythonToolsKit==1.2.4",
            "PegParser>=1.1.4",
            "RC4Encryption==0.0.2",
            "RC6Encryption==1.0.1"
        ],
        "provides_dist": [],
        "obsoletes_dist": [],
        "requires_external": [],
        "project_urls": [
            "Github, https://github.com/mauricelambert/BinaryFileReader",
            "Strings Documentation, https://mauricelambert.github.io/info/python/security/BinaryFileReader/Strings.html",
            "Strings Python Executable, https://mauricelambert.github.io/info/python/security/BinaryFileReader/Strings.pyz",
            "Strings Windows Executable, https://mauricelambert.github.io/info/python/security/BinaryFileReader/Strings.exe",
            "HexaReader Documentation, https://mauricelambert.github.io/info/python/security/BinaryFileReader/HexaReader.html",
            "HexaReader Python Executable, https://mauricelambert.github.io/info/python/security/BinaryFileReader/HexaReader.pyz",
            "HexaReader Windows Executable, https://mauricelambert.github.io/info/python/security/BinaryFileReader/HexaReader.exe",
            "MagicStrings Documentation, https://mauricelambert.github.io/info/python/security/BinaryFileReader/MagicStrings.html",
            "MagicStrings Python Executable, https://mauricelambert.github.io/info/python/security/BinaryFileReader/MagicStrings.pyz",
            "MagicStrings Windows Executable, https://mauricelambert.github.io/info/python/security/BinaryFileReader/MagicStrings.exe",
            "Python Executable, https://mauricelambert.github.io/info/python/security/BinaryFileReader/BinaryFileReader.pyz",
            "Python Windows Executable, https://mauricelambert.github.io/info/python/security/BinaryFileReader/BinaryFileReader.exe"
        ],
        "uploaded_via": "twine/6.1.0 CPython/3.13.2",
        "upload_time": "2025-05-23 12:05:32.751191 UTC",
        "filename": "binaryfilereader-3.0.4.tar.gz",
        "size": "28378",
        "path": "8c/86/9620704dfcb8ad2e70394895d7c28758cc40f01f6ac9b2b39b8730073835/binaryfilereader-3.0.4.tar.gz",
        "python_version": "source",
        "packagetype": "sdist",
        "has_signature": false,
        "md5_digest": "d963e34bdc2eaa178946484eb0ad668d",
        "sha256_digest": "503e42746429d452d507f37de3951c0fe853502bc2385f51577a4379821ca6af",
        "blake2_256_digest": "8c869620704dfcb8ad2e70394895d7c28758cc40f01f6ac9b2b39b8730073835",
        "license_files": [],
        "rn": "1",
        "home_page": "https://github.com/mauricelambert/BinaryFileReader",
        "download_url": "https://mauricelambert.github.io/info/python/security/BinaryFileReader/BinaryFileReader.pyz"
    },
    {
        "metadata_version": "2.3",
        "name": "BlueSkySight",
        "version": "1.0.0",
        "summary": "A client to gather vulnerability-related information from Bluesky.",
        "description": "# BlueSkySight\n\nA client to gather vulnerability-related information from Bluesky.\nThe collected data is then sent to the\n[Vulnerability-Lookup](https://github.com/vulnerability-lookup/vulnerability-lookup) API as sightings.\n\n\n### Installation\n\n[pipx](https://github.com/pypa/pipx) is an easy way to install and run Python applications in isolated environments.\nIt's easy to [install](https://github.com/pypa/pipx?tab=readme-ov-file#on-linux).\n\n```bash\n$ pipx install BlueSkySight\n$ export BLUESKYSIGHT_CONFIG=~/.BlueSkySight/conf.py\n```\n\nThe configuration should be defined in a Python file (e.g., ``~/.BlueSkySight/conf.py``).\nYou must then set an environment variable (``BLUESKYSIGHT_CONFIG``) with the full path to this file.\n\nYou can have a look at [this example](https://github.com/CIRCL/vulnerability-lookup/blob/main/blueskysight/conf_sample.py) of configuration.\n\n\n### Streaming the Firehose\n\n``BlueSkySight-Firehose`` streams data from the Bluesky's firehose and uses PyVulnerabilityLookup to create sightings in Vulnerability-Lookup.\n\n```bash\n$ BlueSkySight-Firehose   \nConnecting to the Bluesky firehose…\nConnection established.\n```\n\n### Streaming a Jetstream service\n\n``BlueSkySight-Jetstream`` connects to Bluesky's firehose via Jetstream.\n\n```bash\n$ BlueSkySight-Jetstream --help\nusage: BlueSkySight-Jetstream [-h] [--collections COLLECTIONS] [--geo {us-east,us-west}] [--instance {1,2}]\n\nConnect to a Jetstream service.\n\noptions:\n  -h, --help            show this help message and exit\n  --collections COLLECTIONS\n                        The collections to subscribe to. If not provided, subscribe to all.\n  --geo {us-east,us-west}\n                        Region of the Jetstream service.\n  --instance {1,2}      Instance of the Jetstream service.\n\n\n$ BlueSkySight-Jetstream \nConnecting to the Bluesky Jetstream at wss://jetstream1.us-west.bsky.network/subscribe?wantedCollections=app.bsky.feed.post…\nConnection established. Listening for messages…\n```\n\n\n## License\n\n[BlueSkySight](https://github.com/vulnerability-lookup/BlueSkySight) is licensed under\n[GNU General Public License version 3](https://www.gnu.org/licenses/gpl-3.0.html)\n\n~~~\nCopyright (c) 2024-2025 Computer Incident Response Center Luxembourg (CIRCL)\nCopyright (C) 2024-2025 Cédric Bonhomme - https://github.com/cedricbonhomme\n~~~\n\n",
        "description_content_type": "text/markdown",
        "license": "GPL-3.0-or-later",
        "keywords": "Vulnerability-Lookup, Vulnerability, CVE, Bluesky",
        "classifiers": [
            "Development Status :: 5 - Production/Stable",
            "Environment :: Console",
            "Intended Audience :: Developers",
            "Intended Audience :: Science/Research",
            "License :: OSI Approved :: GNU General Public License v3 or later (GPLv3+)",
            "Operating System :: POSIX :: Linux",
            "Programming Language :: Python :: 3",
            "Programming Language :: Python :: 3.10",
            "Programming Language :: Python :: 3.11",
            "Programming Language :: Python :: 3.12",
            "Programming Language :: Python :: 3.13",
            "Topic :: Security"
        ],
        "platform": [],
        "requires_python": "<4.0,>=3.10",
        "requires": [],
        "provides": [],
        "obsoletes": [],
        "requires_dist": [
            "cbor2>=5.6.5",
            "httpx>=0.28.1",
            "pyvulnerabilitylookup>=2.2.0",
            "valkey<7.0.0,>=6.1.0",
            "websockets>=14.1",
            "zstandard>=0.23.0"
        ],
        "provides_dist": [],
        "obsoletes_dist": [],
        "requires_external": [],
        "project_urls": [
            "Changelog, https://github.com/vulnerability-lookup/BlueSkySight/blob/main/CHANGELOG.md",
            "Homepage, https://github.com/vulnerability-lookup/BlueSkySight",
            "Repository, https://github.com/vulnerability-lookup/BlueSkySight"
        ],
        "uploaded_via": "twine/6.1.0 CPython/3.12.8",
        "upload_time": "2025-02-13 07:50:35.494441 UTC",
        "filename": "blueskysight-1.0.0.tar.gz",
        "size": "25741",
        "path": "02/af/1aff45d1f42d2d44c5f686f143ef72f2f7242c9e80f52e672d0ed4759a61/blueskysight-1.0.0.tar.gz",
        "python_version": "source",
        "packagetype": "sdist",
        "has_signature": false,
        "md5_digest": "b5a606b4f5f6928c206908a80ce2690a",
        "sha256_digest": "e1a82f863025610d82459a7347d57429a9ae3b927a8e224d81ec29efec270e90",
        "blake2_256_digest": "02af1aff45d1f42d2d44c5f686f143ef72f2f7242c9e80f52e672d0ed4759a61",
        "license_files": [],
        "rn": "1",
        "home_page": null,
        "download_url": null
    },
    {
        "metadata_version": "2.4",
        "name": "ByteBomber",
        "version": "2.3.1",
        "summary": "ZIP bomb generator (for educational purposes only)",
        "description": "ByteBomber is a Python tool for creating ZIP bombs. It demonstrates how compression algorithms (specifically ZIP's DEFLATE) can exploit redundancy to create highly compressed files that expand drastically when extracted. It’s primarily for educational purposes to understand the impact of such files.\n\n## Installation\n\nInstall ByteBomber via pip: `pip install bytebomber`\n\nYou can then use it in your project: `from bytebomber import build_zip_bomb`\n\n## Usage\n\nYou can use ByteBomber as a Python module or directly from your command line.\n\n### As a Python Module\n\nCall `build_zip_bomb()` to create a ZIP bomb. You can pass several arguments to customize the behavior:\n\n```\nbuild_zip_bomb(\n    target_input=\"500 GB\",\n    payload_input=\"1 MB\",\n    zip_name=\"bomb.zip\",\n    folder_name=\"bomb-dir\",\n    verbose=True,\n    show_progress=True\n)\n```\n\n| **Parameter** | Description |\n|----------------| ----------------------------------------------------------------------------------|\n| `target_input` | Total uncompressed size of the ZIP bomb. Default: prompts user or uses `\"500 GB\"`. |\n| `payload_input` | Size of each file inside the ZIP. Smaller values = more files. Default: prompts user or uses `\"1 MB\"`. |\n| `zip_name` | Output ZIP file name. Default: prompts user or uses `\"bomb.zip\"`. |\n| `folder_name` | Internal folder name for the payload files. Default: prompts user or uses `\"bomb_dir\"`. |\n| `verbose` | If `True`, shows config + summary output. Default: `True`. |\n| `show_progress` | If `True`, shows a live progress bar. Default: `True`. |\n\n### Command-Line Usage\n\nWhen you run ByteBomber from your terminal, you can optionally use flags to customize its behavior:\n\n```\nbytebomber --target-size \"100 GB\" --payload-size \"500 KB\" --output \"my_bomb.zip\"\n```\n\n| **Flag** | **Long Flag** | Description |\n|----------|---------------|--------------------------------------------------------------------|\n| `-t`     | `--target-size` | Total uncompressed size of the ZIP bomb (e.g., `\"500 GB\"`). Default: `\"500 GB\"`. |\n| `-p`     | `--payload-size` | Size of each file inside the ZIP (e.g., `\"1 MB\"`). Default: `\"1 MB\"`. |\n| `-o`     | `--output`    | Output ZIP file name. Default: `\"bomb.zip\"`.                         |\n| `-f`     | `--folder`    | Internal folder name for the payload files. Default: `\"bomb-dir\"`.   |\n| `-n`     | `--no-progress` | Disable the live progress bar.                                     |\n| `-q`     | `--quiet`     | Silence all output messages. |\n\n---\n\nUse the format `<number> <unit>` when entering values (e.g., `500 GB`, `1 TB`). ByteBomber supports B, KB, MB, GB, TB, PB, EB, ZB, and YB. Valuse in the GB-TB range are usually more than enough to stress a system. Values above TB are astronomical data zizes far more than most systems can handle.\n\n> [!NOTE]\n> The program accepts values using standard units (e.g., MB, GB), but internally it treats them as binary units (e.g., MiB, GiB).\n\n**ByteBomber is for educational purposes only. Do not deploy ZIP bombs on systems you do not own or have permission to test. Misuse can result in data loss or system damage.**\n",
        "description_content_type": "text/markdown",
        "license": "MIT",
        "keywords": null,
        "classifiers": [
            "Programming Language :: Python :: 3",
            "License :: OSI Approved :: MIT License",
            "Operating System :: OS Independent",
            "Topic :: Security",
            "Topic :: Utilities",
            "Intended Audience :: Developers",
            "Intended Audience :: System Administrators",
            "Development Status :: 5 - Production/Stable"
        ],
        "platform": [],
        "requires_python": "<4.0,>=3.6",
        "requires": [],
        "provides": [],
        "obsoletes": [],
        "requires_dist": [],
        "provides_dist": [],
        "obsoletes_dist": [],
        "requires_external": [],
        "project_urls": [
            "Source, https://github.com/redkitlab/ByteBomber",
            "Documentation, https://github.com/redkitlab/ByteBomber/blob/main/README.md"
        ],
        "uploaded_via": "twine/6.1.0 CPython/3.12.9",
        "upload_time": "2025-06-06 15:23:45.196743 UTC",
        "filename": "bytebomber-2.3.1.tar.gz",
        "size": "4655",
        "path": "ae/c6/16e37355b589c1225e62c07a6e93b90a9d9d004dcc6886cb1a116c3d469e/bytebomber-2.3.1.tar.gz",
        "python_version": "source",
        "packagetype": "sdist",
        "has_signature": false,
        "md5_digest": "e25cb5baed3f51c9e05037d880ba0e58",
        "sha256_digest": "f7f95b0ce749e12a7f27791dd6df8b239ff1d427029b6001c8603e9869b3a916",
        "blake2_256_digest": "aec616e37355b589c1225e62c07a6e93b90a9d9d004dcc6886cb1a116c3d469e",
        "license_files": [
            "LICENSE"
        ],
        "rn": "1",
        "home_page": null,
        "download_url": null
    },
    {
        "metadata_version": "2.4",
        "name": "CaesarCipher.extended",
        "version": "2.9",
        "summary": "Implementation of the Caesar Cipher encryption algorithm in Python. Unlike the classic, it also shifts numbers, symbols & even emojis! Focused on simplicity and Efficiency.",
        "description": "<div align=\"center\">\n\t\t<img src=\"https://img.shields.io/pypi/v/CaesarCipher.extended?color=blue\" alt=\"PyPI version\" />\n\t\t<img src=\"https://img.shields.io/github/license/ViratiAkiraNandhanReddy/CaesarCipher.extended\" alt=\"License\" />\n\t\t<!-- <img src=\"https://img.shields.io/github/actions/workflow/status/ViratiAkiraNandhanReddy/CaesarCipher.extended/python-app.yml?label=build\" alt=\"Build Status\" /> -->\n\t\t<img src=\"https://img.shields.io/github/actions/workflow/status/ViratiAkiraNandhanReddy/CaesarCipher.extended/tests.yml?label=tests\" alt=\"Test Status\" />\n\t\t<img src=\"https://img.shields.io/pypi/dm/CaesarCipher.extended\" alt=\"PyPI Downloads\" />\n\t\t<!-- <img src=\"https://img.shields.io/github/last-commit/ViratiAkiraNandhanReddy/CaesarCipher.extended\" alt=\"Last Commit\" /> -->\n\t\t<img src=\"https://img.shields.io/github/issues/ViratiAkiraNandhanReddy/CaesarCipher.extended\" alt=\"Issues\" />\n\t\t<img src=\"https://img.shields.io/github/stars/ViratiAkiraNandhanReddy/CaesarCipher.extended?style=social\" alt=\"Stars\" />\n\t<h1>CaesarCipher.extended</h1>\n\t<p><em>Simple, creative, and practical Caesar cipher encryption for Python projects.</em></p>\n</div>\n\n---\n\n## 🚀 Why CaesarCipher.extended?\n\nEver wanted to add a layer of protection to your data without the complexity of modern cryptography? CaesarCipher.extended brings the classic Caesar cipher to Python, making it easy to obfuscate text, passwords, usernames, and more. It's not military-grade, but it's a huge step up from plain text!\n\n---\n\n## 🔑 What is the CaesarCipher.extended?\n\nThe Caesar cipher is one of the oldest and simplest encryption techniques. Each character in your text is shifted by a fixed number of positions. This package extends the classic algorithm to support:\n\n- **Letters** (upper & lower case)\n- **Digits** (optional)\n- **Symbols** (optional)\n\t- Symbols <br>\n\t- Emojis (some support)\n\nYou choose what gets encrypted and how!\n\n---\n\n## ✨ Features\n\n- Encrypt and decrypt text with a customizable shift\n- Optionally include digits and symbols\n- Input validation for safety\n- Intuitive API for quick integration\n- Perfect for small to mid-scale projects\n- Much better than storing plain text\n\n---\n\n## 📦 Installation\n\nInstall from PyPI:\n\n```bash\npip install CaesarCipher.extended\n```\n\nOr clone from GitHub:\n\n```bash\ngit clone https://github.com/ViratiAkiraNandhanReddy/CaesarCipher.extended.git\ncd CaesarCipher.extended\n```\n\n---\n\n## 🛠️ Usage\n\n### Encrypting Text\n\n```python\nfrom CaesarCipher import Encryption\n\n# Basic encryption\nenc = Encryption(\"Hello, World! 123\")\nprint(\"Encrypted:\", enc.encrypt())\n\n# Advanced: shift everything\nenc2 = Encryption(\"Secret123!😊\", shift = 7, alterNumbers = True, alterSymbols = True)\nprint(\"Encrypted:\", enc2.encrypt())\n```\n\n### Decrypting Text\n\n```python\nfrom CaesarCipher import Decryption\n\n# Basic decryption\ndec = Decryption(\"Olssv, Dvysk! 890\", shift = 7, isNumbersAltered = True, isSymbolsAltered = True)\nprint(\"Decrypted:\", dec.decrypt())\n```\n\n---\n\n## 📚 API Reference\n\n### Encryption\n\n```python\nEncryption(text: str, shift: int = 3, alterSymbols: bool = False, alterNumbers: bool = False)\n```\n\n- `text`: The string to encrypt\n- `shift`: How many positions to shift (default: 3)\n- `alterSymbols`: Shift symbols? (default: False)\n- `alterNumbers`: Shift digits? (default: False)\n\n#### `.encrypt() -> str`\nReturns the encrypted string.\n\n### Decryption\n\n```python\nDecryption(text: str, shift: int = 3, isSymbolsAltered: bool = False, isNumbersAltered: bool = False)\n```\n\n- `text`: The string to decrypt\n- `shift`: How many positions to shift back (default: 3)\n- `isSymbolsAltered`: Were symbols shifted? (default: False)\n- `isNumbersAltered`: Were digits shifted? (default: False)\n\n#### `.decrypt() -> str`\nReturns the decrypted string.\n\n---\n\n## 🔍 Comparison Table\n\nSee how CaesarCipher transforms your data:\n\n| Stage                | Example Text                |\n|----------------------|---------------------------- |\n| **Original**         | HelloWorld123!              |\n| **After Encryption** | KhoorZruog456!              |\n| **After Decryption** | HelloWorld123!              |\n\n**How it works:**\n- Encryption shifts each character by a fixed amount (default: 3).\n- Decryption reverses the shift, restoring the original text.\n\nYou can customize the shift and choose to include digits and symbols for even more flexibility!\n\n---\n\n## ⚠️ Limitations & Security\n\n- **Not for high-security needs!** Vulnerable to brute-force and frequency analysis.\n- Symbol shifting may produce non-printable characters.\n- For real password storage, use cryptographic hashes (bcrypt, Argon2, etc).\n\n---\n\n## 💡 When Should You Use This?\n\n- Small to mid-scale projects\n- Obfuscating sensitive data (usernames, passwords, tokens)\n- Educational demos\n- Quick protection for logs or configs\n\n> 💯 : Some encryption is always better than none. This package is a practical upgrade from plain text!\n\n---\n\n## 🌐 Social & Links\n\n\n[![LinkedIn](https://img.shields.io/badge/LinkedIn-0A66C2?style=for-the-badge&logo=linkedin&logoColor=white)](https://www.linkedin.com/in/viratiakiranandhanreddy/)\n[![X](https://img.shields.io/badge/Twitter-1DA1F2?style=for-the-badge&logo=x&logoColor=white)](https://x.com/Viratiaki53)\n[![Instagram](https://img.shields.io/badge/Instagram-E1306C?style=for-the-badge&logo=instagram&logoColor=white)](https://instagram.com/viratiaki53)\n[![Facebook](https://img.shields.io/badge/Facebook-1877F2?style=for-the-badge&logo=facebook&logoColor=white)](https://facebook.com/ViratiAkiraNandhanReddy)\n[![Gist](https://img.shields.io/badge/Gist-2b3137?style=for-the-badge&logo=github&logoColor=white)](https://gist.github.com/ViratiAkiraNandhanReddy)\n[![YouTube](https://img.shields.io/badge/YouTube-FF0000?style=for-the-badge&logo=youtube&logoColor=white)](https://www.youtube.com/@ViratiAkiraNandhanReddy)\n[![Website](https://img.shields.io/badge/Website-0077b6?style=for-the-badge&logoColor=white)](https://viratiakiranandhanreddy.github.io/CaesarCipher.extended/)\n[![PyPI](https://img.shields.io/badge/PyPI-3775A9?style=for-the-badge&logo=pypi&logoColor=white)](https://pypi.org/project/CaesarCipher.extended/)\n[![Mail](https://img.shields.io/badge/Mail-D14836?style=for-the-badge&logo=gmail&logoColor=white)](mailto:viratiaki53@gmail.com)\n\n---\n\n## 📝 License\n\n<p align=\"center\"><kbd>&copy; 2025 <a href=\"https://github.com/ViratiAkiraNandhanReddy\">ViratiAkiraNandhanReddy</a>. This project is licensed under the <i> GNU GENERAL PUBLIC LICENSE </i>.</kbd></p>\n\n---\n\n## 👤 Author\n\n### Developed by [ViratiAkiraNandhanReddy](https://github.com/ViratiAkiraNandhanReddy)\n\n> 💤 - PASSIVE MAINTENANCE : Mean the project is no longer actively developed ***( NO New Features And Regular Updates )***, but the maintainer will respond only when an issue or PR is raised. Feel free to fork and continue development!\n\n---\n\n<h3 align=\"center\"> Questions, suggestions, or want to contribute? Open an issue or pull request on GitHub! </h3>\n\n<p align=\"center\"> <img src=\"https://capsule-render.vercel.app/api?type=waving&color=0e8fff&height=100&section=footer\" width=\"100%\" /> </p> \n",
        "description_content_type": "text/markdown",
        "license": "GNU GENERAL PUBLIC LICENSE\n                               Version 3, 29 June 2007\n        \n         Copyright (C) 2007 Free Software Foundation, Inc. <https://fsf.org/>\n         Everyone is permitted to copy and distribute verbatim copies\n         of this license document, but changing it is not allowed.\n        \n                                    Preamble\n        \n          The GNU General Public License is a free, copyleft license for\n        software and other kinds of works.\n        \n          The licenses for most software and other practical works are designed\n        to take away your freedom to share and change the works.  By contrast,\n        the GNU General Public License is intended to guarantee your freedom to\n        share and change all versions of a program--to make sure it remains free\n        software for all its users.  We, the Free Software Foundation, use the\n        GNU General Public License for most of our software; it applies also to\n        any other work released this way by its authors.  You can apply it to\n        your programs, too.\n        \n          When we speak of free software, we are referring to freedom, not\n        price.  Our General Public Licenses are designed to make sure that you\n        have the freedom to distribute copies of free software (and charge for\n        them if you wish), that you receive source code or can get it if you\n        want it, that you can change the software or use pieces of it in new\n        free programs, and that you know you can do these things.\n        \n          To protect your rights, we need to prevent others from denying you\n        these rights or asking you to surrender the rights.  Therefore, you have\n        certain responsibilities if you distribute copies of the software, or if\n        you modify it: responsibilities to respect the freedom of others.\n        \n          For example, if you distribute copies of such a program, whether\n        gratis or for a fee, you must pass on to the recipients the same\n        freedoms that you received.  You must make sure that they, too, receive\n        or can get the source code.  And you must show them these terms so they\n        know their rights.\n        \n          Developers that use the GNU GPL protect your rights with two steps:\n        (1) assert copyright on the software, and (2) offer you this License\n        giving you legal permission to copy, distribute and/or modify it.\n        \n          For the developers' and authors' protection, the GPL clearly explains\n        that there is no warranty for this free software.  For both users' and\n        authors' sake, the GPL requires that modified versions be marked as\n        changed, so that their problems will not be attributed erroneously to\n        authors of previous versions.\n        \n          Some devices are designed to deny users access to install or run\n        modified versions of the software inside them, although the manufacturer\n        can do so.  This is fundamentally incompatible with the aim of\n        protecting users' freedom to change the software.  The systematic\n        pattern of such abuse occurs in the area of products for individuals to\n        use, which is precisely where it is most unacceptable.  Therefore, we\n        have designed this version of the GPL to prohibit the practice for those\n        products.  If such problems arise substantially in other domains, we\n        stand ready to extend this provision to those domains in future versions\n        of the GPL, as needed to protect the freedom of users.\n        \n          Finally, every program is threatened constantly by software patents.\n        States should not allow patents to restrict development and use of\n        software on general-purpose computers, but in those that do, we wish to\n        avoid the special danger that patents applied to a free program could\n        make it effectively proprietary.  To prevent this, the GPL assures that\n        patents cannot be used to render the program non-free.\n        \n          The precise terms and conditions for copying, distribution and\n        modification follow.\n        \n                               TERMS AND CONDITIONS\n        \n          0. Definitions.\n        \n          \"This License\" refers to version 3 of the GNU General Public License.\n        \n          \"Copyright\" also means copyright-like laws that apply to other kinds of\n        works, such as semiconductor masks.\n        \n          \"The Program\" refers to any copyrightable work licensed under this\n        License.  Each licensee is addressed as \"you\".  \"Licensees\" and\n        \"recipients\" may be individuals or organizations.\n        \n          To \"modify\" a work means to copy from or adapt all or part of the work\n        in a fashion requiring copyright permission, other than the making of an\n        exact copy.  The resulting work is called a \"modified version\" of the\n        earlier work or a work \"based on\" the earlier work.\n        \n          A \"covered work\" means either the unmodified Program or a work based\n        on the Program.\n        \n          To \"propagate\" a work means to do anything with it that, without\n        permission, would make you directly or secondarily liable for\n        infringement under applicable copyright law, except executing it on a\n        computer or modifying a private copy.  Propagation includes copying,\n        distribution (with or without modification), making available to the\n        public, and in some countries other activities as well.\n        \n          To \"convey\" a work means any kind of propagation that enables other\n        parties to make or receive copies.  Mere interaction with a user through\n        a computer network, with no transfer of a copy, is not conveying.\n        \n          An interactive user interface displays \"Appropriate Legal Notices\"\n        to the extent that it includes a convenient and prominently visible\n        feature that (1) displays an appropriate copyright notice, and (2)\n        tells the user that there is no warranty for the work (except to the\n        extent that warranties are provided), that licensees may convey the\n        work under this License, and how to view a copy of this License.  If\n        the interface presents a list of user commands or options, such as a\n        menu, a prominent item in the list meets this criterion.\n        \n          1. Source Code.\n        \n          The \"source code\" for a work means the preferred form of the work\n        for making modifications to it.  \"Object code\" means any non-source\n        form of a work.\n        \n          A \"Standard Interface\" means an interface that either is an official\n        standard defined by a recognized standards body, or, in the case of\n        interfaces specified for a particular programming language, one that\n        is widely used among developers working in that language.\n        \n          The \"System Libraries\" of an executable work include anything, other\n        than the work as a whole, that (a) is included in the normal form of\n        packaging a Major Component, but which is not part of that Major\n        Component, and (b) serves only to enable use of the work with that\n        Major Component, or to implement a Standard Interface for which an\n        implementation is available to the public in source code form.  A\n        \"Major Component\", in this context, means a major essential component\n        (kernel, window system, and so on) of the specific operating system\n        (if any) on which the executable work runs, or a compiler used to\n        produce the work, or an object code interpreter used to run it.\n        \n          The \"Corresponding Source\" for a work in object code form means all\n        the source code needed to generate, install, and (for an executable\n        work) run the object code and to modify the work, including scripts to\n        control those activities.  However, it does not include the work's\n        System Libraries, or general-purpose tools or generally available free\n        programs which are used unmodified in performing those activities but\n        which are not part of the work.  For example, Corresponding Source\n        includes interface definition files associated with source files for\n        the work, and the source code for shared libraries and dynamically\n        linked subprograms that the work is specifically designed to require,\n        such as by intimate data communication or control flow between those\n        subprograms and other parts of the work.\n        \n          The Corresponding Source need not include anything that users\n        can regenerate automatically from other parts of the Corresponding\n        Source.\n        \n          The Corresponding Source for a work in source code form is that\n        same work.\n        \n          2. Basic Permissions.\n        \n          All rights granted under this License are granted for the term of\n        copyright on the Program, and are irrevocable provided the stated\n        conditions are met.  This License explicitly affirms your unlimited\n        permission to run the unmodified Program.  The output from running a\n        covered work is covered by this License only if the output, given its\n        content, constitutes a covered work.  This License acknowledges your\n        rights of fair use or other equivalent, as provided by copyright law.\n        \n          You may make, run and propagate covered works that you do not\n        convey, without conditions so long as your license otherwise remains\n        in force.  You may convey covered works to others for the sole purpose\n        of having them make modifications exclusively for you, or provide you\n        with facilities for running those works, provided that you comply with\n        the terms of this License in conveying all material for which you do\n        not control copyright.  Those thus making or running the covered works\n        for you must do so exclusively on your behalf, under your direction\n        and control, on terms that prohibit them from making any copies of\n        your copyrighted material outside their relationship with you.\n        \n          Conveying under any other circumstances is permitted solely under\n        the conditions stated below.  Sublicensing is not allowed; section 10\n        makes it unnecessary.\n        \n          3. Protecting Users' Legal Rights From Anti-Circumvention Law.\n        \n          No covered work shall be deemed part of an effective technological\n        measure under any applicable law fulfilling obligations under article\n        11 of the WIPO copyright treaty adopted on 20 December 1996, or\n        similar laws prohibiting or restricting circumvention of such\n        measures.\n        \n          When you convey a covered work, you waive any legal power to forbid\n        circumvention of technological measures to the extent such circumvention\n        is effected by exercising rights under this License with respect to\n        the covered work, and you disclaim any intention to limit operation or\n        modification of the work as a means of enforcing, against the work's\n        users, your or third parties' legal rights to forbid circumvention of\n        technological measures.\n        \n          4. Conveying Verbatim Copies.\n        \n          You may convey verbatim copies of the Program's source code as you\n        receive it, in any medium, provided that you conspicuously and\n        appropriately publish on each copy an appropriate copyright notice;\n        keep intact all notices stating that this License and any\n        non-permissive terms added in accord with section 7 apply to the code;\n        keep intact all notices of the absence of any warranty; and give all\n        recipients a copy of this License along with the Program.\n        \n          You may charge any price or no price for each copy that you convey,\n        and you may offer support or warranty protection for a fee.\n        \n          5. Conveying Modified Source Versions.\n        \n          You may convey a work based on the Program, or the modifications to\n        produce it from the Program, in the form of source code under the\n        terms of section 4, provided that you also meet all of these conditions:\n        \n            a) The work must carry prominent notices stating that you modified\n            it, and giving a relevant date.\n        \n            b) The work must carry prominent notices stating that it is\n            released under this License and any conditions added under section\n            7.  This requirement modifies the requirement in section 4 to\n            \"keep intact all notices\".\n        \n            c) You must license the entire work, as a whole, under this\n            License to anyone who comes into possession of a copy.  This\n            License will therefore apply, along with any applicable section 7\n            additional terms, to the whole of the work, and all its parts,\n            regardless of how they are packaged.  This License gives no\n            permission to license the work in any other way, but it does not\n            invalidate such permission if you have separately received it.\n        \n            d) If the work has interactive user interfaces, each must display\n            Appropriate Legal Notices; however, if the Program has interactive\n            interfaces that do not display Appropriate Legal Notices, your\n            work need not make them do so.\n        \n          A compilation of a covered work with other separate and independent\n        works, which are not by their nature extensions of the covered work,\n        and which are not combined with it such as to form a larger program,\n        in or on a volume of a storage or distribution medium, is called an\n        \"aggregate\" if the compilation and its resulting copyright are not\n        used to limit the access or legal rights of the compilation's users\n        beyond what the individual works permit.  Inclusion of a covered work\n        in an aggregate does not cause this License to apply to the other\n        parts of the aggregate.\n        \n          6. Conveying Non-Source Forms.\n        \n          You may convey a covered work in object code form under the terms\n        of sections 4 and 5, provided that you also convey the\n        machine-readable Corresponding Source under the terms of this License,\n        in one of these ways:\n        \n            a) Convey the object code in, or embodied in, a physical product\n            (including a physical distribution medium), accompanied by the\n            Corresponding Source fixed on a durable physical medium\n            customarily used for software interchange.\n        \n            b) Convey the object code in, or embodied in, a physical product\n            (including a physical distribution medium), accompanied by a\n            written offer, valid for at least three years and valid for as\n            long as you offer spare parts or customer support for that product\n            model, to give anyone who possesses the object code either (1) a\n            copy of the Corresponding Source for all the software in the\n            product that is covered by this License, on a durable physical\n            medium customarily used for software interchange, for a price no\n            more than your reasonable cost of physically performing this\n            conveying of source, or (2) access to copy the\n            Corresponding Source from a network server at no charge.\n        \n            c) Convey individual copies of the object code with a copy of the\n            written offer to provide the Corresponding Source.  This\n            alternative is allowed only occasionally and noncommercially, and\n            only if you received the object code with such an offer, in accord\n            with subsection 6b.\n        \n            d) Convey the object code by offering access from a designated\n            place (gratis or for a charge), and offer equivalent access to the\n            Corresponding Source in the same way through the same place at no\n            further charge.  You need not require recipients to copy the\n            Corresponding Source along with the object code.  If the place to\n            copy the object code is a network server, the Corresponding Source\n            may be on a different server (operated by you or a third party)\n            that supports equivalent copying facilities, provided you maintain\n            clear directions next to the object code saying where to find the\n            Corresponding Source.  Regardless of what server hosts the\n            Corresponding Source, you remain obligated to ensure that it is\n            available for as long as needed to satisfy these requirements.\n        \n            e) Convey the object code using peer-to-peer transmission, provided\n            you inform other peers where the object code and Corresponding\n            Source of the work are being offered to the general public at no\n            charge under subsection 6d.\n        \n          A separable portion of the object code, whose source code is excluded\n        from the Corresponding Source as a System Library, need not be\n        included in conveying the object code work.\n        \n          A \"User Product\" is either (1) a \"consumer product\", which means any\n        tangible personal property which is normally used for personal, family,\n        or household purposes, or (2) anything designed or sold for incorporation\n        into a dwelling.  In determining whether a product is a consumer product,\n        doubtful cases shall be resolved in favor of coverage.  For a particular\n        product received by a particular user, \"normally used\" refers to a\n        typical or common use of that class of product, regardless of the status\n        of the particular user or of the way in which the particular user\n        actually uses, or expects or is expected to use, the product.  A product\n        is a consumer product regardless of whether the product has substantial\n        commercial, industrial or non-consumer uses, unless such uses represent\n        the only significant mode of use of the product.\n        \n          \"Installation Information\" for a User Product means any methods,\n        procedures, authorization keys, or other information required to install\n        and execute modified versions of a covered work in that User Product from\n        a modified version of its Corresponding Source.  The information must\n        suffice to ensure that the continued functioning of the modified object\n        code is in no case prevented or interfered with solely because\n        modification has been made.\n        \n          If you convey an object code work under this section in, or with, or\n        specifically for use in, a User Product, and the conveying occurs as\n        part of a transaction in which the right of possession and use of the\n        User Product is transferred to the recipient in perpetuity or for a\n        fixed term (regardless of how the transaction is characterized), the\n        Corresponding Source conveyed under this section must be accompanied\n        by the Installation Information.  But this requirement does not apply\n        if neither you nor any third party retains the ability to install\n        modified object code on the User Product (for example, the work has\n        been installed in ROM).\n        \n          The requirement to provide Installation Information does not include a\n        requirement to continue to provide support service, warranty, or updates\n        for a work that has been modified or installed by the recipient, or for\n        the User Product in which it has been modified or installed.  Access to a\n        network may be denied when the modification itself materially and\n        adversely affects the operation of the network or violates the rules and\n        protocols for communication across the network.\n        \n          Corresponding Source conveyed, and Installation Information provided,\n        in accord with this section must be in a format that is publicly\n        documented (and with an implementation available to the public in\n        source code form), and must require no special password or key for\n        unpacking, reading or copying.\n        \n          7. Additional Terms.\n        \n          \"Additional permissions\" are terms that supplement the terms of this\n        License by making exceptions from one or more of its conditions.\n        Additional permissions that are applicable to the entire Program shall\n        be treated as though they were included in this License, to the extent\n        that they are valid under applicable law.  If additional permissions\n        apply only to part of the Program, that part may be used separately\n        under those permissions, but the entire Program remains governed by\n        this License without regard to the additional permissions.\n        \n          When you convey a copy of a covered work, you may at your option\n        remove any additional permissions from that copy, or from any part of\n        it.  (Additional permissions may be written to require their own\n        removal in certain cases when you modify the work.)  You may place\n        additional permissions on material, added by you to a covered work,\n        for which you have or can give appropriate copyright permission.\n        \n          Notwithstanding any other provision of this License, for material you\n        add to a covered work, you may (if authorized by the copyright holders of\n        that material) supplement the terms of this License with terms:\n        \n            a) Disclaiming warranty or limiting liability differently from the\n            terms of sections 15 and 16 of this License; or\n        \n            b) Requiring preservation of specified reasonable legal notices or\n            author attributions in that material or in the Appropriate Legal\n            Notices displayed by works containing it; or\n        \n            c) Prohibiting misrepresentation of the origin of that material, or\n            requiring that modified versions of such material be marked in\n            reasonable ways as different from the original version; or\n        \n            d) Limiting the use for publicity purposes of names of licensors or\n            authors of the material; or\n        \n            e) Declining to grant rights under trademark law for use of some\n            trade names, trademarks, or service marks; or\n        \n            f) Requiring indemnification of licensors and authors of that\n            material by anyone who conveys the material (or modified versions of\n            it) with contractual assumptions of liability to the recipient, for\n            any liability that these contractual assumptions directly impose on\n            those licensors and authors.\n        \n          All other non-permissive additional terms are considered \"further\n        restrictions\" within the meaning of section 10.  If the Program as you\n        received it, or any part of it, contains a notice stating that it is\n        governed by this License along with a term that is a further\n        restriction, you may remove that term.  If a license document contains\n        a further restriction but permits relicensing or conveying under this\n        License, you may add to a covered work material governed by the terms\n        of that license document, provided that the further restriction does\n        not survive such relicensing or conveying.\n        \n          If you add terms to a covered work in accord with this section, you\n        must place, in the relevant source files, a statement of the\n        additional terms that apply to those files, or a notice indicating\n        where to find the applicable terms.\n        \n          Additional terms, permissive or non-permissive, may be stated in the\n        form of a separately written license, or stated as exceptions;\n        the above requirements apply either way.\n        \n          8. Termination.\n        \n          You may not propagate or modify a covered work except as expressly\n        provided under this License.  Any attempt otherwise to propagate or\n        modify it is void, and will automatically terminate your rights under\n        this License (including any patent licenses granted under the third\n        paragraph of section 11).\n        \n          However, if you cease all violation of this License, then your\n        license from a particular copyright holder is reinstated (a)\n        provisionally, unless and until the copyright holder explicitly and\n        finally terminates your license, and (b) permanently, if the copyright\n        holder fails to notify you of the violation by some reasonable means\n        prior to 60 days after the cessation.\n        \n          Moreover, your license from a particular copyright holder is\n        reinstated permanently if the copyright holder notifies you of the\n        violation by some reasonable means, this is the first time you have\n        received notice of violation of this License (for any work) from that\n        copyright holder, and you cure the violation prior to 30 days after\n        your receipt of the notice.\n        \n          Termination of your rights under this section does not terminate the\n        licenses of parties who have received copies or rights from you under\n        this License.  If your rights have been terminated and not permanently\n        reinstated, you do not qualify to receive new licenses for the same\n        material under section 10.\n        \n          9. Acceptance Not Required for Having Copies.\n        \n          You are not required to accept this License in order to receive or\n        run a copy of the Program.  Ancillary propagation of a covered work\n        occurring solely as a consequence of using peer-to-peer transmission\n        to receive a copy likewise does not require acceptance.  However,\n        nothing other than this License grants you permission to propagate or\n        modify any covered work.  These actions infringe copyright if you do\n        not accept this License.  Therefore, by modifying or propagating a\n        covered work, you indicate your acceptance of this License to do so.\n        \n          10. Automatic Licensing of Downstream Recipients.\n        \n          Each time you convey a covered work, the recipient automatically\n        receives a license from the original licensors, to run, modify and\n        propagate that work, subject to this License.  You are not responsible\n        for enforcing compliance by third parties with this License.\n        \n          An \"entity transaction\" is a transaction transferring control of an\n        organization, or substantially all assets of one, or subdividing an\n        organization, or merging organizations.  If propagation of a covered\n        work results from an entity transaction, each party to that\n        transaction who receives a copy of the work also receives whatever\n        licenses to the work the party's predecessor in interest had or could\n        give under the previous paragraph, plus a right to possession of the\n        Corresponding Source of the work from the predecessor in interest, if\n        the predecessor has it or can get it with reasonable efforts.\n        \n          You may not impose any further restrictions on the exercise of the\n        rights granted or affirmed under this License.  For example, you may\n        not impose a license fee, royalty, or other charge for exercise of\n        rights granted under this License, and you may not initiate litigation\n        (including a cross-claim or counterclaim in a lawsuit) alleging that\n        any patent claim is infringed by making, using, selling, offering for\n        sale, or importing the Program or any portion of it.\n        \n          11. Patents.\n        \n          A \"contributor\" is a copyright holder who authorizes use under this\n        License of the Program or a work on which the Program is based.  The\n        work thus licensed is called the contributor's \"contributor version\".\n        \n          A contributor's \"essential patent claims\" are all patent claims\n        owned or controlled by the contributor, whether already acquired or\n        hereafter acquired, that would be infringed by some manner, permitted\n        by this License, of making, using, or selling its contributor version,\n        but do not include claims that would be infringed only as a\n        consequence of further modification of the contributor version.  For\n        purposes of this definition, \"control\" includes the right to grant\n        patent sublicenses in a manner consistent with the requirements of\n        this License.\n        \n          Each contributor grants you a non-exclusive, worldwide, royalty-free\n        patent license under the contributor's essential patent claims, to\n        make, use, sell, offer for sale, import and otherwise run, modify and\n        propagate the contents of its contributor version.\n        \n          In the following three paragraphs, a \"patent license\" is any express\n        agreement or commitment, however denominated, not to enforce a patent\n        (such as an express permission to practice a patent or covenant not to\n        sue for patent infringement).  To \"grant\" such a patent license to a\n        party means to make such an agreement or commitment not to enforce a\n        patent against the party.\n        \n          If you convey a covered work, knowingly relying on a patent license,\n        and the Corresponding Source of the work is not available for anyone\n        to copy, free of charge and under the terms of this License, through a\n        publicly available network server or other readily accessible means,\n        then you must either (1) cause the Corresponding Source to be so\n        available, or (2) arrange to deprive yourself of the benefit of the\n        patent license for this particular work, or (3) arrange, in a manner\n        consistent with the requirements of this License, to extend the patent\n        license to downstream recipients.  \"Knowingly relying\" means you have\n        actual knowledge that, but for the patent license, your conveying the\n        covered work in a country, or your recipient's use of the covered work\n        in a country, would infringe one or more identifiable patents in that\n        country that you have reason to believe are valid.\n        \n          If, pursuant to or in connection with a single transaction or\n        arrangement, you convey, or propagate by procuring conveyance of, a\n        covered work, and grant a patent license to some of the parties\n        receiving the covered work authorizing them to use, propagate, modify\n        or convey a specific copy of the covered work, then the patent license\n        you grant is automatically extended to all recipients of the covered\n        work and works based on it.\n        \n          A patent license is \"discriminatory\" if it does not include within\n        the scope of its coverage, prohibits the exercise of, or is\n        conditioned on the non-exercise of one or more of the rights that are\n        specifically granted under this License.  You may not convey a covered\n        work if you are a party to an arrangement with a third party that is\n        in the business of distributing software, under which you make payment\n        to the third party based on the extent of your activity of conveying\n        the work, and under which the third party grants, to any of the\n        parties who would receive the covered work from you, a discriminatory\n        patent license (a) in connection with copies of the covered work\n        conveyed by you (or copies made from those copies), or (b) primarily\n        for and in connection with specific products or compilations that\n        contain the covered work, unless you entered into that arrangement,\n        or that patent license was granted, prior to 28 March 2007.\n        \n          Nothing in this License shall be construed as excluding or limiting\n        any implied license or other defenses to infringement that may\n        otherwise be available to you under applicable patent law.\n        \n          12. No Surrender of Others' Freedom.\n        \n          If conditions are imposed on you (whether by court order, agreement or\n        otherwise) that contradict the conditions of this License, they do not\n        excuse you from the conditions of this License.  If you cannot convey a\n        covered work so as to satisfy simultaneously your obligations under this\n        License and any other pertinent obligations, then as a consequence you may\n        not convey it at all.  For example, if you agree to terms that obligate you\n        to collect a royalty for further conveying from those to whom you convey\n        the Program, the only way you could satisfy both those terms and this\n        License would be to refrain entirely from conveying the Program.\n        \n          13. Use with the GNU Affero General Public License.\n        \n          Notwithstanding any other provision of this License, you have\n        permission to link or combine any covered work with a work licensed\n        under version 3 of the GNU Affero General Public License into a single\n        combined work, and to convey the resulting work.  The terms of this\n        License will continue to apply to the part which is the covered work,\n        but the special requirements of the GNU Affero General Public License,\n        section 13, concerning interaction through a network will apply to the\n        combination as such.\n        \n          14. Revised Versions of this License.\n        \n          The Free Software Foundation may publish revised and/or new versions of\n        the GNU General Public License from time to time.  Such new versions will\n        be similar in spirit to the present version, but may differ in detail to\n        address new problems or concerns.\n        \n          Each version is given a distinguishing version number.  If the\n        Program specifies that a certain numbered version of the GNU General\n        Public License \"or any later version\" applies to it, you have the\n        option of following the terms and conditions either of that numbered\n        version or of any later version published by the Free Software\n        Foundation.  If the Program does not specify a version number of the\n        GNU General Public License, you may choose any version ever published\n        by the Free Software Foundation.\n        \n          If the Program specifies that a proxy can decide which future\n        versions of the GNU General Public License can be used, that proxy's\n        public statement of acceptance of a version permanently authorizes you\n        to choose that version for the Program.\n        \n          Later license versions may give you additional or different\n        permissions.  However, no additional obligations are imposed on any\n        author or copyright holder as a result of your choosing to follow a\n        later version.\n        \n          15. Disclaimer of Warranty.\n        \n          THERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY\n        APPLICABLE LAW.  EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT\n        HOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY\n        OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO,\n        THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\n        PURPOSE.  THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM\n        IS WITH YOU.  SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF\n        ALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n        \n          16. Limitation of Liability.\n        \n          IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\n        WILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR CONVEYS\n        THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY\n        GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE\n        USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF\n        DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD\n        PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS),\n        EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF\n        SUCH DAMAGES.\n        \n          17. Interpretation of Sections 15 and 16.\n        \n          If the disclaimer of warranty and limitation of liability provided\n        above cannot be given local legal effect according to their terms,\n        reviewing courts shall apply local law that most closely approximates\n        an absolute waiver of all civil liability in connection with the\n        Program, unless a warranty or assumption of liability accompanies a\n        copy of the Program in return for a fee.\n        \n                             END OF TERMS AND CONDITIONS\n        \n                    How to Apply These Terms to Your New Programs\n        \n          If you develop a new program, and you want it to be of the greatest\n        possible use to the public, the best way to achieve this is to make it\n        free software which everyone can redistribute and change under these terms.\n        \n          To do so, attach the following notices to the program.  It is safest\n        to attach them to the start of each source file to most effectively\n        state the exclusion of warranty; and each file should have at least\n        the \"copyright\" line and a pointer to where the full notice is found.\n        \n            <one line to give the program's name and a brief idea of what it does.>\n            Copyright (C) <year>  <name of author>\n        \n            This program is free software: you can redistribute it and/or modify\n            it under the terms of the GNU General Public License as published by\n            the Free Software Foundation, either version 3 of the License, or\n            (at your option) any later version.\n        \n            This program is distributed in the hope that it will be useful,\n            but WITHOUT ANY WARRANTY; without even the implied warranty of\n            MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n            GNU General Public License for more details.\n        \n            You should have received a copy of the GNU General Public License\n            along with this program.  If not, see <https://www.gnu.org/licenses/>.\n        \n        Also add information on how to contact you by electronic and paper mail.\n        \n          If the program does terminal interaction, make it output a short\n        notice like this when it starts in an interactive mode:\n        \n            <program>  Copyright (C) <year>  <name of author>\n            This program comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n            This is free software, and you are welcome to redistribute it\n            under certain conditions; type `show c' for details.\n        \n        The hypothetical commands `show w` and `show c` should show the appropriate\n        parts of the General Public License.  Of course, your program's commands\n        might be different; for a GUI interface, you would use an \"about box\".\n        \n          You should also get your employer (if you work as a programmer) or school,\n        if any, to sign a \"copyright disclaimer\" for the program, if necessary.\n        For more information on this, and how to apply and follow the GNU GPL, see\n        <https://www.gnu.org/licenses/>.\n        \n          The GNU General Public License does not permit incorporating your program\n        into proprietary programs.  If your program is a subroutine library, you\n        may consider it more useful to permit linking proprietary applications with\n        the library.  If this is what you want to do, use the GNU Lesser General\n        Public License instead of this License.  But first, please read\n        <https://www.gnu.org/licenses/why-not-lgpl.html>.",
        "keywords": "Caesar Cipher, encryption, decryption, cryptography, Python",
        "classifiers": [
            "Programming Language :: Python :: 3",
            "License :: OSI Approved :: GNU General Public License v3 (GPLv3)",
            "Operating System :: OS Independent",
            "Development Status :: 5 - Production/Stable",
            "Intended Audience :: Developers",
            "Topic :: Security :: Cryptography",
            "Topic :: Software Development :: Libraries :: Python Modules"
        ],
        "platform": [],
        "requires_python": ">=3.11",
        "requires": [],
        "provides": [],
        "obsoletes": [],
        "requires_dist": [],
        "provides_dist": [],
        "obsoletes_dist": [],
        "requires_external": [],
        "project_urls": [
            "Homepage, https://viratiakiranandhanreddy.github.io/CaesarCipher.extended/",
            "Repository, https://github.com/ViratiAkiraNandhanReddy/CaesarCipher.extended",
            "Issues, https://github.com/ViratiAkiraNandhanReddy/CaesarCipher.extended/issues"
        ],
        "uploaded_via": "twine/6.2.0 CPython/3.13.7",
        "upload_time": "2025-10-11 20:26:30.683319 UTC",
        "filename": "caesarcipher_extended-2.9.tar.gz",
        "size": "48669",
        "path": "db/62/56ccef20797e2bb75bf2f5653708bd3e837766b9064cc61113bbe840dd80/caesarcipher_extended-2.9.tar.gz",
        "python_version": "source",
        "packagetype": "sdist",
        "has_signature": false,
        "md5_digest": "53c4db57524c2bc405f1d343d82ec425",
        "sha256_digest": "bb64ddfb2eb26f4062f00c5d8bc360d2f7f71f732e1bcab4072c61cda16ac65a",
        "blake2_256_digest": "db6256ccef20797e2bb75bf2f5653708bd3e837766b9064cc61113bbe840dd80",
        "license_files": [
            "LICENSE"
        ],
        "rn": "1",
        "home_page": null,
        "download_url": null
    },
    {
        "metadata_version": "2.1",
        "name": "ChromePasswordsStealer",
        "version": "1.0.2",
        "summary": "This module steals chrome and chromium passwords on Windows",
        "description": "![ChromePasswordsStealer logo](https://mauricelambert.github.io/info/python/security/ChromePasswordsStealer_small.png \"ChromePasswordsStealer logo\")\n\n# ChromePasswordsStealer\n\n## Description\n\nThis module steals chrome and chromium passwords on Windows.\n\n## Requirements\n\nThis package require:\n - python3\n - python3 Standard Library\n - pywin32\n - PythonToolsKit\n - PyCryptodome\n\n## Installation\n\n```bash\npip install ChromePasswordsStealer\n```\n\n## Usages\n\n## Command lines\n\n```bash\n# Python executable\npython3 ChromePasswordsStealer.pyz -h\n# or\nchmod u+x ChromePasswordsStealer.pyz\n./ChromePasswordsStealer.pyz --help\n\n# Python module\npython3 -m ChromePasswordsStealer\n\n# Entry point (console)\nChromeStealer --save-all --window -f passwords\n```\n\n### Python script\n\n```python\nfrom ChromePasswordsStealer import ChromePasswordsStealer\nstealer = ChromePasswordsStealer()\nstealer = ChromiumPasswordsStealer(\"passwords\", True)\nstealer.get_database_cursor()\nstealer.get_key()\nfor url, username, password in stealer.get_credentials():\n    print(url, username, password)\n\nstealer.save_and_clean()\n```\n\n## Help\n\n```text\n~# python3 ChromePasswordsStealer.py -h\n\nusage: ChromePasswordsStealer.py [-h] [--filename FILENAME] [--window] [--save-all]\n\nThis program steals Chrome passwords on Windows.\n\noptional arguments:\n  -h, --help            show this help message and exit\n  --filename FILENAME, -f FILENAME\n                        The filename to export the credentials.\n  --window, -w          Do not hide the console.\n  --save-all, -s        Save chrome db, key file and key.\n```\n\n## Links\n\n - [Github Page](https://github.com/mauricelambert/ChromePasswordsStealer/)\n - [Documentation](https://mauricelambert.github.io/info/python/security/ChromePasswordsStealer.html)\n - [Python Executable](https://mauricelambert.github.io/info/python/security/ChromePasswordsStealer.pyz)\n - [Windows Executable - Github](https://github.com/mauricelambert/ChromePasswordsStealer/releases/latest)\n - [Windows Executable - SourceForge](https://sourceforge.net/projects/chromepasswordsstealer/files/latest/download)\n - [Pypi package](https://pypi.org/project/ChromePasswordsStealer/)\n\n## Licence\n\nLicensed under the [GPL, version 3](https://www.gnu.org/licenses/).\n\n\n",
        "description_content_type": "text/markdown",
        "license": "GPL-3.0 License",
        "keywords": "Chrome,Google,Passwords,Decrypt,Steal,Recovery,Security",
        "classifiers": [
            "Programming Language :: Python",
            "Development Status :: 5 - Production/Stable",
            "Environment :: Console",
            "Natural Language :: English",
            "Topic :: Security",
            "Natural Language :: English",
            "Programming Language :: Python :: 3.9",
            "Operating System :: Microsoft :: Windows"
        ],
        "platform": [
            "Windows"
        ],
        "requires_python": ">=3.8",
        "requires": [],
        "provides": [],
        "obsoletes": [],
        "requires_dist": [],
        "provides_dist": [],
        "obsoletes_dist": [],
        "requires_external": [],
        "project_urls": [
            "Documentation, https://mauricelambert.github.io/info/python/security/ChromePasswordsStealer.html",
            "Python Executable, https://mauricelambert.github.io/info/python/security/ChromePasswordsStealer.pyz",
            "Windows Executable - Github, https://github.com/mauricelambert/ChromePasswordsStealer/releases/latest",
            "Windows Executable - SourceForge, https://sourceforge.net/projects/chromepasswordsstealer/files/latest/download"
        ],
        "uploaded_via": "twine/3.2.0 pkginfo/1.6.1 requests/2.25.0 setuptools/59.6.0 requests-toolbelt/0.9.1 tqdm/4.54.1 CPython/3.9.11",
        "upload_time": "2022-04-14 19:27:53.651729 UTC",
        "filename": "ChromePasswordsStealer-1.0.2.tar.gz",
        "size": "20444",
        "path": "b7/78/9ee2e6ec398c95bc03a33534b85cc066cf934a8ce5b8b22f538543aba1e8/ChromePasswordsStealer-1.0.2.tar.gz",
        "python_version": "source",
        "packagetype": "sdist",
        "has_signature": false,
        "md5_digest": "69d0944d170bb894ea437b5e2d3290b8",
        "sha256_digest": "ccd38196ef62c5de994c4c38a39211eba64d370c196bb3c1747dce44e3eb0d1f",
        "blake2_256_digest": "b7789ee2e6ec398c95bc03a33534b85cc066cf934a8ce5b8b22f538543aba1e8",
        "license_files": [],
        "rn": "1",
        "home_page": "https://github.com/mauricelambert/ChromePasswordsStealer",
        "download_url": null
    },
    {
        "metadata_version": "2.1",
        "name": "CipherSmith",
        "version": "1.1.0",
        "summary": "A powerful password generator with real-time strength analysis",
        "description": "# 🔐 CipherSmith\n\n[![PyPI version](https://badge.fury.io/py/CipherSmith.svg)](https://badge.fury.io/py/CipherSmith)\n[![Python Versions](https://img.shields.io/pypi/pyversions/CipherSmith.svg)](https://pypi.org/project/CipherSmith/)\n[![License: MIT](https://img.shields.io/badge/License-MIT-yellow.svg)](https://opensource.org/licenses/MIT)\n[![Downloads](https://pepy.tech/badge/CipherSmith)](https://pepy.tech/project/CipherSmith)\n[![Code style: black](https://img.shields.io/badge/code%20style-black-000000.svg)](https://github.com/psf/black)\n\nA powerful and flexible command-line password generator with real-time strength analysis. Built with security and usability in mind! 🚀\n\n## ✨ Features\n\n- 🎯 Generate cryptographically secure passwords\n- 🔄 Customizable length and complexity\n- 🎨 Include or exclude special characters, numbers, and uppercase letters\n- 📋 Copy generated passwords to clipboard\n- 💾 Save passwords to an encrypted file (optional)\n- 🖥️ Command-line interface for easy integration\n- 🔍 Advanced password strength analysis\n- 🏷️ Tag and organize passwords\n- 📊 Password generation statistics\n- 🔒 Secure storage using SQLite with encryption\n- 📈 Real-time strength visualization\n- ⚡ Crack time estimation\n- 🎯 Pattern detection and feedback\n\n## 🚀 Quick Start\n\n### Prerequisites\n\n- Python 3.9 or higher\n- pip (Python package installer)\n\n### Installation\n\n```bash\npip install CipherSmith\n```\n\n### Basic Usage\n\n```bash\n# Generate a secure password\nCipherSmith generate\n\n# Generate and analyze password strength\nCipherSmith generate --check-strength\n\n# Check existing password strength\nCipherSmith check \"YourPassword123\"\n\n# Generate password with specific requirements\nCipherSmith generate --uppercase 2 --lowercase 6 --digits 2 --special 2\n\n# Save passwords to file\nCipherSmith generate --save passwords.txt --count 3\n```\n\n## 🔍 Password Strength Analysis\n\nCipherSmith now includes advanced password strength analysis:\n\n- Real-time strength visualization\n- Pattern detection\n- Crack time estimation\n- Security suggestions\n- Comprehensive feedback\n\nExample output:\n```\nPassword Strength Analysis\n\nStrength: Strong ██████████████████░░ 80%\n\nEstimated crack time: 3 centuries\n\nIssues Found:\n✗ Contains common word pattern\n✗ Predictable character substitutions\n\nSuggestions:\n• Use more unique character combinations\n• Avoid common word patterns\n• Add special characters\n```\n\n## 📚 Documentation\n\nFor detailed documentation, visit our [Documentation Page](https://CipherSmith.readthedocs.io/).\n\nCommon topics:\n- [Installation Guide](LOCAL_INSTALL.md)\n- [Usage Examples](DEMO.md)\n- [API Reference](https://CipherSmith.readthedocs.io/api)\n\n## 🤝 Contributing\n\nContributions are welcome! Please feel free to submit a Pull Request. For major changes, please open an issue first to discuss what you would like to change.\n\n## 📝 License\n\nThis project is licensed under the MIT License - see the [LICENSE](LICENSE) file for details.\n\n## 🌟 Star Us!\n\nIf you find CipherSmith helpful, please consider giving us a star on GitHub! It helps us know that you find the project useful.\n",
        "description_content_type": "text/markdown",
        "license": null,
        "keywords": null,
        "classifiers": [
            "Development Status :: 5 - Production/Stable",
            "Intended Audience :: Developers",
            "Topic :: Security :: Cryptography",
            "License :: OSI Approved :: MIT License",
            "Programming Language :: Python :: 3",
            "Programming Language :: Python :: 3.9",
            "Programming Language :: Python :: 3.10",
            "Programming Language :: Python :: 3.11",
            "Operating System :: OS Independent"
        ],
        "platform": [],
        "requires_python": ">=3.9",
        "requires": [],
        "provides": [],
        "obsoletes": [],
        "requires_dist": [
            "typer>=0.9.0",
            "rich>=10.0.0",
            "zxcvbn-python>=4.4.24",
            "cryptography>=41.0.0",
            "sqlalchemy>=2.0.0",
            "click>=8.0.0",
            "colorama>=0.4.4"
        ],
        "provides_dist": [],
        "obsoletes_dist": [],
        "requires_external": [],
        "project_urls": [
            "Bug Tracker, https://github.com/Amul-Thantharate/CipherSmith/issues",
            "Documentation, https://CipherSmith.readthedocs.io/"
        ],
        "uploaded_via": "twine/5.1.1 CPython/3.12.7",
        "upload_time": "2024-11-21 11:41:32.410532 UTC",
        "filename": "ciphersmith-1.1.0.tar.gz",
        "size": "5913",
        "path": "e9/fd/f7c37d63f42a5fb35bb06383cd2a29c528b8280d1ffd4900fa609245597b/ciphersmith-1.1.0.tar.gz",
        "python_version": "source",
        "packagetype": "sdist",
        "has_signature": false,
        "md5_digest": "74922e407a516434332bda909b5e3b6a",
        "sha256_digest": "b01dbbd8548805aee7ffdf700afd8423b63cb54e4436b8eda5528b5a50db2780",
        "blake2_256_digest": "e9fdf7c37d63f42a5fb35bb06383cd2a29c528b8280d1ffd4900fa609245597b",
        "license_files": [],
        "rn": "1",
        "home_page": "https://github.com/Amul-Thantharate/CipherSmith",
        "download_url": null
    },
    {
        "metadata_version": "2.1",
        "name": "ComPP",
        "version": "1.0.5",
        "summary": null,
        "description": "<center><img src=\"static/logo.png\" alt=\"ComPP\" width=\"300px\"></center>\n\n# ComPP - Company Passwords Profiler\n\n![Build](https://img.shields.io/badge/Built%20with-Python3-Blue)\n[![GitHub forks](https://img.shields.io/github/forks/sec-it/ComPP)](https://github.com/sec-it/ComPP/network)\n[![GitHub stars](https://img.shields.io/github/stars/sec-it/ComPP)](https://github.com/sec-it/ComPP/stargazers)\n[![GitHub](https://img.shields.io/github/license/sec-it/ComPP)](https://github.com/sec-it/ComPP/blob/master/LICENSE)\n\n![PyPI - Python Version](https://img.shields.io/pypi/pyversions/ComPP)\n\nCompany Passwords Profiler (aka ComPP) helps making a bruteforce wordlist for a targeted company.\n\n```text\n\n ▄████████  ▄██████▄    ▄▄▄▄███▄▄▄▄      ▄███████▄    ▄███████▄ \n███     ██ ███    ███ ▄██▀▀▀███▀▀▀██▄   ███    ███   ███    ███ \n███    █▀  ██     ███ ███   ███   ██    ███    ███    ██    ███ \n███        ███    ███ ███   ███   ███   ███    ███   ███    ███ \n███        ███     ██ ███   ███   ███ ▀█████████▀  ▀█████████▀  \n██     █▄  ███    ███ ███   ███   ███   ███          ███        \n███    ███ ███    ███ ███    ██   ███   ██           ██         \n ███████▀   ▀██████▀   ▀█   ███   █▀   ▄████▀       ▄████▀  :)    \n \nVersion : 1.0.5  \n\nusage: compp [-h] [-p PERMUTATIONS] [-c CONFIG] [-l] [-n] [-o OUTPUT] [-v] [input_file]\n\nCompany Passwords Profiler (ComPP)\n\npositional arguments:\n  input_file            company.json input file\n\noptional arguments:\n  -h, --help            show this help message and exit\n  -p PERMUTATIONS, --permutations PERMUTATIONS\n                        Number of permutations\n  -c CONFIG, --config CONFIG\n                        Configuration file\n  -l, --leet            Add 1337 passwords transformation\n  -n, --numbers         Add numbers to password\n  -o OUTPUT, --output OUTPUT\n                        Directs the output to a file of your choice\n  -v, --version         Show the version of this program\n```\n\n## What ❓\n\nThe tool responds to a need to generate wordlists **quickly** with **few inputs**. The generated passwords will contain generic company informations with transformation such as `APPNAME2019!` or `Company75000$`.\n\nThe main use of the generated wordlist is with **remote bruteforce and password spraying attack** such as a ssh service or a WordPress website.\n\nThis tool aims to replace [CeWL](https://github.com/digininja/CeWL) because web scrapping is not be the most efficient way to generate a wordlist.\n\n> Note: If you have time to perform OSINT research against the targeted users, you may use tools such as [CUPP](https://github.com/Mebus/cupp) or [BEWGor](https://github.com/berzerk0/BEWGor) to **complete** your wordlist.\n\n## Install ⚙️\n\nOn BlackArch :\n\n[![BlackArch package](https://repology.org/badge/version-for-repo/blackarch/compp.svg)](https://repology.org/project/compp/versions)\n\n```\nsudo pacman -Syu compp\n```\n\nWith PIP from PyPI packages :\n\n[![PyPI](https://img.shields.io/pypi/v/ComPP)](https://pypi.org/project/ComPP/)\n\n```bash\npip install ComPP\n```\n\nWith python from GitHub repository :\n\n[![GitHub tag (latest SemVer)](https://img.shields.io/github/v/tag/sec-it/ComPP)](https://github.com/sec-it/ComPP/tags)\n\n```bash\ngit clone git@github.com:sec-it/ComPP.git\ncd ComPP\npython setup.py install\n```\n\n## Inputs 🔡\n\nUser inputs can either be filled in the interactive prompt or through a json file. If an input is unknown to the user, it suffices to leave the field empty in order to go to the next field. Here is the full program prompt:\n\n```text\n$ compp\n\n ▄████████  ▄██████▄    ▄▄▄▄███▄▄▄▄      ▄███████▄    ▄███████▄ \n███     ██ ███    ███ ▄██▀▀▀███▀▀▀██▄   ███    ███   ███    ███ \n███    █▀  ██     ███ ███   ███   ██    ███    ███    ██    ███ \n███        ███    ███ ███   ███   ███   ███    ███   ███    ███ \n███        ███     ██ ███   ███   ███ ▀█████████▀  ▀█████████▀  \n██     █▄  ███    ███ ███   ███   ███   ███          ███        \n███    ███ ███    ███ ███    ██   ███   ██           ██         \n ███████▀   ▀██████▀   ▀█   ███   █▀   ▄████▀       ▄████▀  :)    \n \nVersion : 1.0.5  \n\nFill the differents inputs (case insensitive). Leave blank for unknow fields.\n\n[+] Enter company/application names (comma separated): Company,Comp\n[+] Enter company zip codes (comma separated): 75,75000\n[+] Enter company cities names (comma separated): Paris\n[+] Useful keywords (comma separated): Appname\n```\n\n*Or*\n\n```text\n$ compp example.json\n```\n\n## Outputs\n\nOutput size may vary with the provided options. Here is a preview of what you can expect with the default options:\n\n```text\n75#Appname\n75000%company\nAppname1995?\nappname$\nappname1995+\nCompParis2000\nCompany75000!\nCOMPANYAPPNAME2019#\nPARISCOMP!\nParisCompany2021_\nParis75000@\n...\n```\n\n## What are the proposed transformations ?\n\n1. First, the tool compute case transformation for each fields (lowercase, UPPERCASE and Capitalize). The originals set of fields and the 3 generated sets are added to the wordlist.\n2. Then, the tool apply [itertools.combination()](https://docs.python.org/3/library/itertools.html#itertools.permutations) on each set with a default size up to 2. The use of such combination avoid having the same word twice in the same password. The generated combinations are added to the wordlist\n3. The tool add a range of years to the previously generated wordlist. The original wordlist is also kept.\n4. The tool add a range of special chars to the previously generated wordlist. The original wordlist is also kept.\n5. (Optional) The tool add a range of numbers to the previously generated wordlist. The original wordlist is also kept.\n6. (Optional) The tool add a l33t transformation to the previously generated wordlist. The original wordlist is also kept.\n\n## Author\n\nMade by Alex G. ([@zeecka_](https://twitter.com/Zeecka_)), pentester at SEC-IT.\n\n\n",
        "description_content_type": "text/markdown",
        "license": "MIT License",
        "keywords": null,
        "classifiers": [
            "Development Status :: 5 - Production/Stable",
            "Environment :: Console",
            "Intended Audience :: Information Technology",
            "License :: OSI Approved :: MIT License",
            "Natural Language :: English",
            "Programming Language :: Python :: 3.7",
            "Programming Language :: Python :: 3.8",
            "Programming Language :: Python :: 3.9",
            "Programming Language :: Python :: 3.10",
            "Programming Language :: Python :: Implementation",
            "Topic :: Security"
        ],
        "platform": [],
        "requires_python": ">=3.7",
        "requires": [],
        "provides": [],
        "obsoletes": [],
        "requires_dist": [],
        "provides_dist": [],
        "obsoletes_dist": [],
        "requires_external": [],
        "project_urls": [
            "Source, https://github.com/sec-it/ComPP",
            "Tracker, https://github.com/sec-it/ComPP/issues"
        ],
        "uploaded_via": "twine/3.4.1 importlib_metadata/4.6.1 pkginfo/1.7.1 requests/2.25.1 requests-toolbelt/0.9.1 tqdm/4.61.2 CPython/3.9.6",
        "upload_time": "2021-07-23 08:59:03.319567 UTC",
        "filename": "ComPP-1.0.5.tar.gz",
        "size": "6836",
        "path": "53/e3/8c3f279e486797937d3a0e1114558a8da03f54dce5e9f6585c7a6df21540/ComPP-1.0.5.tar.gz",
        "python_version": "source",
        "packagetype": "sdist",
        "has_signature": false,
        "md5_digest": "0d332688a82321916ba8fed0f63101ed",
        "sha256_digest": "d940965683df73ef009a7da9dd81634ed312aca408b2f5ab56fddf055e745a8d",
        "blake2_256_digest": "53e38c3f279e486797937d3a0e1114558a8da03f54dce5e9f6585c7a6df21540",
        "license_files": [],
        "rn": "1",
        "home_page": "https://github.com/sec-it/ComPP",
        "download_url": null
    },
    {
        "metadata_version": "2.1",
        "name": "ComboundFileParser",
        "version": "0.0.1",
        "summary": "This module implements a Compound file parser (file format used by OLE and base file format for macros, msi, msg, doc, xls...)",
        "description": "![ComboundFileParser Logo](https://mauricelambert.github.io/info/python/security/ComboundFileParser_small.png \"ComboundFileParser logo\")\n\n# ComboundFileParser\n\n## Description\n\nThis module implements a Compound file parser (file format used by OLE\nand base file format for macros, msi, msg, doc, xls...)\n\n## Requirements\n\nThis package require:\n - python3\n - python3 Standard Library\n\n## Installation\n\n### Pip\n\n```bash\npython3 -m pip install ComboundFileParser\n```\n\n### Git\n\n```bash\ngit clone \"https://github.com/mauricelambert/ComboundFileParser.git\"\ncd \"ComboundFileParser\"\npython3 -m pip install .\n```\n\n### Wget\n\n```bash\nwget https://github.com/mauricelambert/ComboundFileParser/archive/refs/heads/main.zip\nunzip main.zip\ncd ComboundFileParser-main\npython3 -m pip install .\n```\n\n### cURL\n\n```bash\ncurl -O https://github.com/mauricelambert/ComboundFileParser/archive/refs/heads/main.zip\nunzip main.zip\ncd ComboundFileParser-main\npython3 -m pip install .\n```\n\n## Usages\n\n### Command line\n\n```bash\nComboundFileParser              # Using CLI package executable\npython3 -m ComboundFileParser   # Using python module\npython3 ComboundFileParser.pyz  # Using python executable\nComboundFileParser.exe          # Using python Windows executable\n```\n\n### Python script\n\n```python\nfrom ComboundFileParser import *\n```\n\n## Links\n\n - [Pypi](https://pypi.org/project/ComboundFileParser)\n - [Github](https://github.com/mauricelambert/ComboundFileParser)\n - [Documentation](https://mauricelambert.github.io/info/python/security/ComboundFileParser.html)\n - [Python executable](https://mauricelambert.github.io/info/python/security/ComboundFileParser.pyz)\n - [Python Windows executable](https://mauricelambert.github.io/info/python/security/ComboundFileParser.exe)\n\n## License\n\nLicensed under the [GPL, version 3](https://www.gnu.org/licenses/).\n",
        "description_content_type": "text/markdown",
        "license": "GPL-3.0 License",
        "keywords": "OLE, CompoundFile, Parser, microsoft, macros, msi, msg, mail, doc, xls",
        "classifiers": [
            "Topic :: System",
            "Topic :: Security",
            "Operating System :: POSIX",
            "Natural Language :: English",
            "Programming Language :: Python",
            "Intended Audience :: Developers",
            "Operating System :: MacOS :: MacOS X",
            "Programming Language :: Python :: 3.8",
            "Operating System :: Microsoft :: Windows",
            "Development Status :: 5 - Production/Stable",
            "License :: OSI Approved :: GNU General Public License v3 or later (GPLv3+)"
        ],
        "platform": [
            "Windows"
        ],
        "requires_python": ">=3.8",
        "requires": [],
        "provides": [],
        "obsoletes": [],
        "requires_dist": [],
        "provides_dist": [],
        "obsoletes_dist": [],
        "requires_external": [],
        "project_urls": [
            "Github, https://github.com/mauricelambert/ComboundFileParser",
            "Documentation, https://mauricelambert.github.io/info/python/security/ComboundFileParser.html"
        ],
        "uploaded_via": "twine/5.1.0 CPython/3.13.2",
        "upload_time": "2025-03-08 13:51:58.71614 UTC",
        "filename": "comboundfileparser-0.0.1.tar.gz",
        "size": "22574",
        "path": "28/35/293cd5a1c46aa6015c5f1a7d7d3eb524b347fb6c4dd41a7af397c29450a1/comboundfileparser-0.0.1.tar.gz",
        "python_version": "source",
        "packagetype": "sdist",
        "has_signature": false,
        "md5_digest": "7038126b0d02254af2f78e5db5fea63e",
        "sha256_digest": "63e2b3b5b6398d7988bb428428f7aa8838d475a947b681c75eeb2f2b6b9bcc7e",
        "blake2_256_digest": "2835293cd5a1c46aa6015c5f1a7d7d3eb524b347fb6c4dd41a7af397c29450a1",
        "license_files": [],
        "rn": "1",
        "home_page": "https://github.com/mauricelambert/ComboundFileParser",
        "download_url": "https://mauricelambert.github.io/info/python/security/ComboundFileParser.pyz"
    },
    {
        "metadata_version": "2.1",
        "name": "CompartirIgualdad",
        "version": "1.5",
        "summary": "Sistema hecho en python para compartir archivos en la red",
        "description": "# Compartir Igualdad\nDesarrollo en python para compartir archivos mediante una web local.\n\nRealizado a partir de la materia Aplicaciones Libres de la Universidad del Comahue Regional Curza.\n\n**Su instalación:**\n\n`pip install CompartirIgualdad`\n\n**Subido en pypi.org:** https://pypi.org/project/CompartirIgualdad/\n\nCódigo Fuente: https://github.com/Z4mbr4/CompartirIgualdad/\n\n\n\n",
        "description_content_type": "text/markdown",
        "license": "GPLv3",
        "keywords": "Compartir Igualdad - HTTP server SimpleHTTPServer directory",
        "classifiers": [
            "Development Status :: 5 - Production/Stable",
            "Environment :: Console",
            "Environment :: Web Environment",
            "Framework :: Flask",
            "Intended Audience :: Developers",
            "Intended Audience :: System Administrators",
            "License :: OSI Approved :: MIT License",
            "Natural Language :: English",
            "Operating System :: MacOS",
            "Operating System :: Microsoft :: Windows",
            "Operating System :: POSIX",
            "Programming Language :: Python :: 3",
            "Programming Language :: Python :: 3.4",
            "Programming Language :: Python :: 3.5",
            "Programming Language :: Python :: 3.6",
            "Programming Language :: Python :: 3.7",
            "Programming Language :: Python :: 3.8",
            "Topic :: Communications :: File Sharing",
            "Topic :: Internet :: WWW/HTTP",
            "Topic :: Internet :: WWW/HTTP :: WSGI",
            "Topic :: Security"
        ],
        "platform": [],
        "requires_python": null,
        "requires": [],
        "provides": [],
        "obsoletes": [],
        "requires_dist": [
            "colorama",
            "flask",
            "flask-httpauth",
            "pyopenssl",
            "werkzeug"
        ],
        "provides_dist": [],
        "obsoletes_dist": [],
        "requires_external": [],
        "project_urls": [],
        "uploaded_via": "twine/4.0.0 CPython/3.8.10",
        "upload_time": "2022-04-19 12:09:26.896603 UTC",
        "filename": "CompartirIgualdad-1.5-py3-none-any.whl",
        "size": "2621392",
        "path": "d5/e1/1af4fdf79bc1a8ea2f6016bf902f751a1f35c6fa7eac9f7303271be7156f/CompartirIgualdad-1.5-py3-none-any.whl",
        "python_version": "py3",
        "packagetype": "bdist_wheel",
        "has_signature": false,
        "md5_digest": "514b0f7d2bbd15a306d20186eb19b83c",
        "sha256_digest": "06a4ca41748f05edf03f4a08d163964f46a0a11795653872aa5222414f4560b9",
        "blake2_256_digest": "d5e11af4fdf79bc1a8ea2f6016bf902f751a1f35c6fa7eac9f7303271be7156f",
        "license_files": [],
        "rn": "1",
        "home_page": "https://github.com/sc0tfree/updog",
        "download_url": "https://github.com/Z4mbr4/CompartirIgualdad.tar.gz"
    },
    {
        "metadata_version": "2.2",
        "name": "Cr0wl3r",
        "version": "1.1.1",
        "summary": "This module implements a crawler to find all links and resources on the target web site.",
        "description": "![Cr0wl3r logo](https://mauricelambert.github.io/info/python/security/Cr0wl3r_small.png \"Cr0wl3r logo\")\n\n# Cr0wl3r\n\n## Description\n\nThis package implements a web discreet crawler to find all visible URLs on a website, this crawler can store pages (and reuse them for next crawl), scan web content for dynamic content (useful for pentest, red teaming and hacking), create a full JSON report and database to reuse the analysis, try to identify web pages, static content and assets to request only what is useful.\n\n> The name *Cr0wl3r* is a pun with *Crawler* and *Growler* because this tool in not offensive but it's the first step to attack a web server.\n\n## Requirements\n\nThis package require:\n\n - python3\n - python3 Standard Library\n\nOptional:\n\n - Selenium\n\n## Installation\n\n### Pip\n\n```bash\npip install Cr0wl3r \n```\n\n### Git\n\n```bash\ngit clone \"https://github.com/mauricelambert/Cr0wl3r.git\"\ncd \"Cr0wl3r\"\npython3 -m pip install .\n```\n\n### Wget\n\n```bash\nwget https://github.com/mauricelambert/Cr0wl3r/archive/refs/heads/main.zip\nunzip main.zip\ncd Cr0wl3r-main\npython3 -m pip install .\n```\n\n### cURL\n\n```bash\ncurl -O https://github.com/mauricelambert/Cr0wl3r/archive/refs/heads/main.zip\nunzip main.zip\ncd Cr0wl3r-main\npython3 -m pip install .\n```\n\n## Usages\n\n### Command lines\n\n```bash\n# Python executable\npython3 Cr0wl3r.pyz -h\n# or\nchmod u+x Cr0wl3r.pyz\n./Cr0wl3r.pyz --help\n\n# Python module\npython3 -m Cr0wl3r https://github.com/mauricelambert\n\n# Entry point (console)\nCr0wl3r -F report.json -L DEBUG -l logs.log -R -S -d -c \"mycookie=foobar\" -H \"User-Agent:Chrome\" -m 3 -t \"p\" -r https://github.com/mauricelambert\nCr0wl3r -R -S -C -d -u -i -F report.json -L DEBUG -l logs.log -c \"mycookie=foobar\" \"session=abc\" -c \"counter=5\" -H \"User-Agent:Chrome\" \"Api-Key:myapikey\" -H \"Authorization:Basic QWxhZGRpbjpvcGVuIHNlc2FtZQ==\" -m 5 -t \"p\" \"img\" -t \"link\" -I 3.5 -f \"raw-url-only\" -D4 \"text/html\" -q -r https://github.com/mauricelambert\n```\n\n### Python script\n\n```python\nfrom Cr0wl3r import CrawlerRawPrinter\n\nCrawlerRawPrinter(\n    \"https://github.com/mauricelambert\",\n    recursive=False,\n).crawl()\n```\n\n```python\nfrom ssl import _create_unverified_context\nfrom Cr0wl3r import _Crawler, reports\nfrom logging import basicConfig\nfrom typing import Union\n\nbasicConfig(level=1)\n\nclass CustomCr0wl3r(_Crawler):\n    def handle_web_page(\n        self, from_url: str, url: str, tag: str, attribute: str\n    ) -> Union[bool, None]:\n\n        print(\"[+] New web page:\", url, \"from\", from_url, f\"{tag}<{attribute}>\")\n        print(\"[*] There are still\", len(self.urls_to_parse), \"requests to send.\")\n\n    def handle_static(\n        self, from_url: str, url: str, tag: str, attribute: str\n    ) -> Union[bool, None]:\n\n        print(\"[+] New static:\", url, \"from\", from_url, f\"{tag}<{attribute}>\")\n        print(\"[*] There are still\", len(self.urls_to_parse), \"requests to send.\")\n\n    def handle_resource(\n        self, from_url: str, url: str, tag: str, attribute: str\n    ) -> Union[bool, None]:\n\n        print(\"[+] New assets:\", url, \"from\", from_url, f\"{tag}<{attribute}>\")\n        print(\"[*] There are still\", len(self.urls_to_parse), \"requests to send.\")\n\ncr0wl3r = CustomCr0wl3r(\n    \"https://github.com/mauricelambert\",\n    recursive=True,\n    update=True,\n    max_request=10,\n    only_domain=False,\n    headers={\"User-Agent\": \"Chrome\", \"Cookie\": \"mycookie=abc\"},\n    robots=False,\n    sitemap=False,\n    crossdomain=False,\n    context=_create_unverified_context(),\n    interval=3.5,\n    download_policy=\"do not download\",\n    no_query_page=False,\n)\ncr0wl3r.crawl()\n\nwith open(\"urls.txt\", 'w') as report:\n    [report.write(url + '\\n') for url in reports]\n```\n\n## Links\n\n - [Github Page](https://github.com/mauricelambert/Cr0wl3r)\n - [Pypi](https://pypi.org/project/Cr0wl3r/)\n - [Documentation](https://mauricelambert.github.io/info/python/security/Cr0wl3r.html)\n - [Python Executable](https://mauricelambert.github.io/info/python/security/Cr0wl3r.pyz)\n - [Windows Python Executable](https://mauricelambert.github.io/info/python/security/Cr0wl3r.exe)\n\n## Help\n\n```text\n~# Cr0wl3r --help\nusage: Cr0wl3r [-h] [--recursive] [--update] [--insecure] [--do-not-request-robots] [--do-not-request-sitemap] [--do-not-request-crossdomain] [--not-only-domain] [--max-request MAX_REQUEST] [--cookies COOKIES [COOKIES ...]]\n               [--headers HEADERS [HEADERS ...]] [--dynamic-tags-counter DYNAMIC_TAGS_COUNTER [DYNAMIC_TAGS_COUNTER ...]] [--report-filename REPORT_FILENAME] [--loglevel {DEBUG,INFO,REQUEST,WARNING,ERROR,CRITICAL}] [--logfile LOGFILE]\n               [--interval-request INTERVAL_REQUEST] [--output-format {raw-url-only,colored,raw}] [--no-query-page]\n               [--download-all | --download-html | --download-static | --download-resources | --download-by-content-type DOWNLOAD_BY_CONTENT_TYPE | --download-requested | --do-not-download]\n               url\n\nThis script crawls web site and prints URLs.\n\npositional arguments:\n  url                   First URL to crawl.\n\noptions:\n  -h, --help            show this help message and exit\n  --recursive, -r       Crawl URLs recursively.\n  --update, -u          Re-downloads and overwrites responses from requests made during previous crawls.\n  --insecure, -i        Use insecure SSL (support selenium and urllib)\n  --do-not-request-robots, --no-robots, -R\n                        Don't search, request and parse robots.txt\n  --do-not-request-sitemap, --no-sitemap, -S\n                        Don't search, request and parse sitemap.xml\n  --do-not-request-crossdomain, --no-crossdomain, -C\n                        Don't search, request and parse crossdomain.xml\n  --not-only-domain, -d\n                        Do not request only the base URL domain (request all domains).\n  --max-request MAX_REQUEST, -m MAX_REQUEST\n                        Maximum request to perform.\n  --cookies COOKIES [COOKIES ...], -c COOKIES [COOKIES ...]\n                        Add a cookie.\n  --headers HEADERS [HEADERS ...], -H HEADERS [HEADERS ...]\n                        Add headers.\n  --dynamic-tags-counter DYNAMIC_TAGS_COUNTER [DYNAMIC_TAGS_COUNTER ...], --tags-counter DYNAMIC_TAGS_COUNTER [DYNAMIC_TAGS_COUNTER ...], --tags DYNAMIC_TAGS_COUNTER [DYNAMIC_TAGS_COUNTER ...], -t DYNAMIC_TAGS_COUNTER [DYNAMIC_TAGS_COUNTER ...]\n                        Add a tag counter for scoring.\n  --report-filename REPORT_FILENAME, --report REPORT_FILENAME, -F REPORT_FILENAME\n                        The JSON report filename.\n  --loglevel {DEBUG,INFO,REQUEST,WARNING,ERROR,CRITICAL}, -L {DEBUG,INFO,REQUEST,WARNING,ERROR,CRITICAL}\n                        WebCrawler logs level.\n  --logfile LOGFILE, -l LOGFILE\n                        WebCrawler logs file.\n  --interval-request INTERVAL_REQUEST, --interval INTERVAL_REQUEST, -I INTERVAL_REQUEST\n                        Interval between each requests by domain.\n  --output-format {raw-url-only,colored,raw}, --format {raw-url-only,colored,raw}, -f {raw-url-only,colored,raw}\n                        Output format.\n  --no-query-page, --no-query, -q\n                        Request only when path is different, without this option the same path will be requested for each differents queries.\n  --download-all, --download, -D, -D0\n                        Download (store) all responses\n  --download-html, --dh, -D1\n                        Download (store) only HTML responses\n  --download-static, --ds, -D2\n                        Download (store) only static files (HTML, CSS, JavaScript)\n  --download-resources, --dr, -D3\n                        Download (store) only resources files (images, documents, icon...)\n  --download-by-content-type DOWNLOAD_BY_CONTENT_TYPE, --dct DOWNLOAD_BY_CONTENT_TYPE, -D4 DOWNLOAD_BY_CONTENT_TYPE\n                        Download (store) only responses with Content-Type that contains this value\n  --download-requested, --dR, -D5\n                        Download all requests responses and try to requests only Web page\n  --do-not-download, --dN, -D6\n                        Try to requests only Web page and do not download\n\n~# \n```\n\n## Licence\n\nLicensed under the [GPL, version 3](https://www.gnu.org/licenses/).\n",
        "description_content_type": "text/markdown",
        "license": "GPL-3.0 License",
        "keywords": "Crawler, Scraper, Scan, Web, Pentest, Discovery, Security, Selenium, URL, URI",
        "classifiers": [
            "Topic :: Security",
            "Environment :: Console",
            "Operating System :: MacOS",
            "Operating System :: POSIX",
            "Topic :: System :: Shells",
            "Natural Language :: English",
            "Topic :: Internet :: WWW/HTTP",
            "Programming Language :: Python",
            "Intended Audience :: Developers",
            "Topic :: System :: System Shells",
            "Operating System :: POSIX :: Linux",
            "Operating System :: MacOS :: MacOS X",
            "Programming Language :: Python :: 3.9",
            "Operating System :: Microsoft :: Windows",
            "Topic :: Software Development :: Libraries",
            "Intended Audience :: System Administrators",
            "Development Status :: 5 - Production/Stable",
            "Topic :: Internet :: WWW/HTTP :: Indexing/Search",
            "License :: OSI Approved :: GNU General Public License v3 (GPLv3)",
            "Topic :: Internet :: WWW/HTTP :: Site Management :: Link Checking"
        ],
        "platform": [
            "Windows"
        ],
        "requires_python": ">=3.8",
        "requires": [],
        "provides": [],
        "obsoletes": [],
        "requires_dist": [],
        "provides_dist": [],
        "obsoletes_dist": [],
        "requires_external": [],
        "project_urls": [
            "Github, https://github.com/mauricelambert/Cr0wl3r",
            "Documentation, https://mauricelambert.github.io/info/python/security/Cr0wl3r.html",
            "Python Executable, https://mauricelambert.github.io/info/python/security/Cr0wl3r.pyz",
            "Windows Executable, https://mauricelambert.github.io/info/python/security/Cr0wl3r.exe"
        ],
        "uploaded_via": "twine/6.1.0 CPython/3.13.2",
        "upload_time": "2025-07-19 13:37:46.171656 UTC",
        "filename": "cr0wl3r-1.1.1.tar.gz",
        "size": "38083",
        "path": "ca/32/678b77e155a534d630c5a970fd97eec35d60b3cd76e18e4c2c833b9c7833/cr0wl3r-1.1.1.tar.gz",
        "python_version": "source",
        "packagetype": "sdist",
        "has_signature": false,
        "md5_digest": "fc40fc8918521a875b919f98a4c2eaf5",
        "sha256_digest": "a0fd27507c47d23047c558023d7594b6217a7f6b1d5d31377409d7778a7f3ca7",
        "blake2_256_digest": "ca32678b77e155a534d630c5a970fd97eec35d60b3cd76e18e4c2c833b9c7833",
        "license_files": [],
        "rn": "1",
        "home_page": "https://github.com/mauricelambert/Cr0wl3r",
        "download_url": "https://mauricelambert.github.io/info/python/security/Cr0wl3r.pyz"
    },
    {
        "metadata_version": "2.4",
        "name": "Cryalg",
        "version": "1.2.6",
        "summary": "Fast and Portable Cryptography Extension Library for Pyrogram",
        "description": "# TgCrypto\n\n> [!NOTE]\n> The project is no longer maintained or supported. Thanks for appreciating it.\n\n> [!NOTE]\n> The implementations of the algorithms presented in this repository are to be considered for educational purposes only.\n\n> Fast and Portable Cryptography Extension Library for Pyrogram\n\n**TgCrypto** is a Cryptography Library written in C as a Python extension. It is designed to be portable, fast,\neasy to install and use. TgCrypto is intended for [Pyrogram](https://github.com/pyrogram/pyrogram) and implements the\ncryptographic algorithms Telegram requires, namely:\n\n- **`AES-256-IGE`** - used in [MTProto v2.0](https://core.telegram.org/mtproto).\n- **`AES-256-CTR`** - used for [CDN encrypted files](https://core.telegram.org/cdn).\n- **`AES-256-CBC`** - used for [encrypted passport credentials](https://core.telegram.org/passport).\n\n## Requirements\n\n- Python 3.7 or higher.\n\n## Installation\n\n``` bash\n$ pip3 install -U tgcrypto\n```\n\n## API\n\nTgCrypto API consists of these six methods:\n\n```python\ndef ige256_encrypt(data: bytes, key: bytes, iv: bytes) -> bytes: ...\ndef ige256_decrypt(data: bytes, key: bytes, iv: bytes) -> bytes: ...\n\ndef ctr256_encrypt(data: bytes, key: bytes, iv: bytes, state: bytes) -> bytes: ...\ndef ctr256_decrypt(data: bytes, key: bytes, iv: bytes, state: bytes) -> bytes: ...\n\ndef cbc256_encrypt(data: bytes, key: bytes, iv: bytes) -> bytes: ...\ndef cbc256_decrypt(data: bytes, key: bytes, iv: bytes) -> bytes: ...\n```\n\n## Usage\n\n### IGE Mode\n\n**Note**: Data must be padded to match a multiple of the block size (16 bytes).\n\n``` python\nimport os\n\nimport tgcrypto\n\ndata = os.urandom(10 * 1024 * 1024 + 7)  # 10 MB of random data + 7 bytes to show padding\nkey = os.urandom(32)  # Random Key\niv = os.urandom(32)  # Random IV\n\n# Pad with zeroes: -7 % 16 = 9\ndata += bytes(-len(data) % 16)\n\nige_encrypted = tgcrypto.ige256_encrypt(data, key, iv)\nige_decrypted = tgcrypto.ige256_decrypt(ige_encrypted, key, iv)\n\nprint(data == ige_decrypted)  # True\n```\n    \n### CTR Mode (single chunk)\n\n``` python\nimport os\n\nimport tgcrypto\n\ndata = os.urandom(10 * 1024 * 1024)  # 10 MB of random data\n\nkey = os.urandom(32)  # Random Key\n\nenc_iv = bytearray(os.urandom(16))  # Random IV\ndec_iv = enc_iv.copy()  # Keep a copy for decryption\n\nctr_encrypted = tgcrypto.ctr256_encrypt(data, key, enc_iv, bytes(1))\nctr_decrypted = tgcrypto.ctr256_decrypt(ctr_encrypted, key, dec_iv, bytes(1))\n\nprint(data == ctr_decrypted)  # True\n```\n\n### CTR Mode (stream)\n\n``` python\nimport os\nfrom io import BytesIO\n\nimport tgcrypto\n\ndata = BytesIO(os.urandom(10 * 1024 * 1024))  # 10 MB of random data\n\nkey = os.urandom(32)  # Random Key\n\nenc_iv = bytearray(os.urandom(16))  # Random IV\ndec_iv = enc_iv.copy()  # Keep a copy for decryption\n\nenc_state = bytes(1)  # Encryption state, starts from 0\ndec_state = bytes(1)  # Decryption state, starts from 0\n\nencrypted_data = BytesIO()  # Encrypted data buffer\ndecrypted_data = BytesIO()  # Decrypted data buffer\n\nwhile True:\n    chunk = data.read(1024)\n\n    if not chunk:\n        break\n\n    # Write 1K encrypted bytes into the encrypted data buffer\n    encrypted_data.write(tgcrypto.ctr256_encrypt(chunk, key, enc_iv, enc_state))\n\n# Reset position. We need to read it now\nencrypted_data.seek(0)\n\nwhile True:\n    chunk = encrypted_data.read(1024)\n\n    if not chunk:\n        break\n\n    # Write 1K decrypted bytes into the decrypted data buffer\n    decrypted_data.write(tgcrypto.ctr256_decrypt(chunk, key, dec_iv, dec_state))\n\nprint(data.getvalue() == decrypted_data.getvalue())  # True\n```\n\n### CBC Mode\n\n**Note**: Data must be padded to match a multiple of the block size (16 bytes).\n\n``` python\nimport os\n\nimport tgcrypto\n\ndata = os.urandom(10 * 1024 * 1024 + 7)  # 10 MB of random data + 7 bytes to show padding\nkey = os.urandom(32)  # Random Key\n\nenc_iv = bytearray(os.urandom(16))  # Random IV\ndec_iv = enc_iv.copy()  # Keep a copy for decryption\n\n# Pad with zeroes: -7 % 16 = 9\ndata += bytes(-len(data) % 16)\n\ncbc_encrypted = tgcrypto.cbc256_encrypt(data, key, enc_iv)\ncbc_decrypted = tgcrypto.cbc256_decrypt(cbc_encrypted, key, dec_iv)\n\nprint(data == cbc_decrypted)  # True\n```\n\n## Testing\n\n1. Clone this repository: `git clone https://github.com/pyrogram/tgcrypto`.\n2. Enter the directory: `cd tgcrypto`.\n3. Install `tox`: `pip3 install tox`\n4. Run tests: `tox`.\n\n## License\n\n[LGPLv3+](COPYING.lesser) © 2017-present [Dan](https://github.com/delivrance)\n",
        "description_content_type": "text/markdown",
        "license": "LGPLv3+",
        "keywords": "pyrogram telegram crypto cryptography encryption mtproto extension library aes",
        "classifiers": [
            "Development Status :: 5 - Production/Stable",
            "Intended Audience :: Developers",
            "License :: OSI Approved :: GNU Lesser General Public License v3 or later (LGPLv3+)",
            "Operating System :: OS Independent",
            "Programming Language :: C",
            "Programming Language :: Python",
            "Programming Language :: Python :: 3",
            "Programming Language :: Python :: 3.10",
            "Programming Language :: Python :: 3.11",
            "Programming Language :: Python :: 3.12",
            "Programming Language :: Python :: 3.13",
            "Programming Language :: Python :: Implementation",
            "Programming Language :: Python :: Implementation :: CPython",
            "Programming Language :: Python :: Implementation :: PyPy",
            "Topic :: Security",
            "Topic :: Security :: Cryptography",
            "Topic :: Internet",
            "Topic :: Communications",
            "Topic :: Communications :: Chat",
            "Topic :: Software Development :: Libraries",
            "Topic :: Software Development :: Libraries :: Python Modules"
        ],
        "platform": [],
        "requires_python": "~=3.10",
        "requires": [],
        "provides": [],
        "obsoletes": [],
        "requires_dist": [],
        "provides_dist": [],
        "obsoletes_dist": [],
        "requires_external": [],
        "project_urls": [
            "Tracker, https://github.com/pyrogram/tgcrypto/issues",
            "Community, https://t.me/pyrogram",
            "Source, https://github.com/rpt0/tgcrypto",
            "Documentation, https://docs.pyrogram.org"
        ],
        "uploaded_via": "twine/6.2.0 CPython/3.12.11",
        "upload_time": "2025-09-14 18:55:02.008258 UTC",
        "filename": "cryalg-1.2.6-cp314-cp314t-musllinux_1_2_x86_64.whl",
        "size": "61990",
        "path": "fe/cc/a8d8041e26a06e9c89fbd7aca1cb452dabb77e84616615283f3f9c45756b/cryalg-1.2.6-cp314-cp314t-musllinux_1_2_x86_64.whl",
        "python_version": "cp314",
        "packagetype": "bdist_wheel",
        "has_signature": false,
        "md5_digest": "320105744482ae54162a784777f6dfa2",
        "sha256_digest": "a94d44f04df4024b66177986e9ffcfb2d8053555faca12a09faf1524609f31ce",
        "blake2_256_digest": "fecca8d8041e26a06e9c89fbd7aca1cb452dabb77e84616615283f3f9c45756b",
        "license_files": [
            "COPYING",
            "COPYING.lesser",
            "NOTICE"
        ],
        "rn": "1",
        "home_page": "https://github.com/rpt0",
        "download_url": "https://github.com/pyrogram/tgcrypto/releases/latest"
    },
    {
        "metadata_version": null,
        "name": "CryptoDataHub",
        "version": "1.0.0",
        "summary": "Repository of cryptography-related data",
        "description": ".. image:: https://gitlab.com/coroner/cryptodatahub/badges/master/pipeline.svg\n    :alt:  Pipeline\n    :target: https://gitlab.com/coroner/cryptodatahub/-/pipelines/master/latest\n.. image:: https://coveralls.io/repos/gitlab/coroner/cryptodatahub/badge.svg?branch=master\n    :alt:  Test Coverage\n    :target: https://coveralls.io/gitlab/coroner/cryptodatahub/\n.. image:: https://readthedocs.org/projects/cryptodatahub/badge/?version=latest\n    :alt:  Documentation\n    :target: https://cryptodatahub.readthedocs.io\n\n**CryptoDataHub** is a repository of cryptography-related data available under a free license. The main goal of the\nrepository is to support cryptographic library tester and client/server cryptographic settings analyzer applications\nsuch as `CryptoLyzer <https://cryptolyzer.readthedocs.io/>`__ with reliable and freely available data.\n\n--------------\nPython Wrapper\n--------------\n\nInstallation\n============\n\n.. code:: shell\n\n   pip install cryptodatahub\n\nSupport\n=======\n\nImplementations\n---------------\n\n-  CPython (3.9+)\n-  PyPy (3.9+)\n\nOperating systems\n-----------------\n\n-  Linux\n-  macOS\n-  Windows\n\n-------------\nDocumentation\n-------------\n\nDetailed `documentation <https://cryptodatahub.readthedocs.io>`__ is available on the project's\n`Read the Docs <https://readthedocs.com>`__ site.\n\n-------\nLicense\n-------\n\nThe `code <https://gitlab.com/coroner/cryptodatahub>`__ is available under the terms of\n`Mozilla Public License Version 2.0 <https://www.mozilla.org/en-US/MPL/2.0/>`__ (MPL 2.0).\n\nA non-comprehensive, but straightforward description of MPL 2.0 can be found at\n`Choose an open source license <https://choosealicense.com/licenses#mpl-2.0>`__ website.\n\n-------\nCredits\n-------\n\n-  `NLnet Foundation <https://nlnet.nl>`__ and `NGI Assure <https://www.assure.ngi.eu>`__, supports the project part of\n   the `Next Generation Internet <https://ngi.eu>`__ initiative.\n",
        "description_content_type": "text/x-rst",
        "license": "MPL-2.0",
        "keywords": "ssl, tls, ssh, dns, dnssec",
        "classifiers": [
            "Development Status :: 5 - Production/Stable",
            "Environment :: Console",
            "Framework :: tox",
            "Intended Audience :: Information Technology",
            "Intended Audience :: Science/Research",
            "Intended Audience :: System Administrators",
            "License :: OSI Approved :: Mozilla Public License 2.0 (MPL 2.0)",
            "Natural Language :: English",
            "Operating System :: MacOS",
            "Operating System :: Microsoft :: Windows",
            "Operating System :: POSIX",
            "Programming Language :: Python",
            "Programming Language :: Python :: 3.10",
            "Programming Language :: Python :: 3.11",
            "Programming Language :: Python :: 3.12",
            "Programming Language :: Python :: 3.13",
            "Programming Language :: Python :: 3.9",
            "Programming Language :: Python :: Implementation :: CPython",
            "Programming Language :: Python :: Implementation :: PyPy",
            "Topic :: Internet",
            "Topic :: Security",
            "Topic :: Security :: Cryptography",
            "Topic :: Software Development :: Libraries :: Python Modules"
        ],
        "platform": [],
        "requires_python": null,
        "requires": [],
        "provides": [],
        "obsoletes": [],
        "requires_dist": [
            "asn1crypto",
            "attrs",
            "python-dateutil",
            "urllib3",
            "pyfakefs; extra == \"tests\"",
            "beautifulsoup4; extra == \"tests\"",
            "sphinx; extra == \"docs\"",
            "sphinx-sitemap; extra == \"docs\""
        ],
        "provides_dist": [],
        "obsoletes_dist": [],
        "requires_external": [],
        "project_urls": [
            "Changelog",
            "Documentation",
            "Homepage",
            "Issues",
            "Source"
        ],
        "uploaded_via": "twine/6.0.1 CPython/3.13.1",
        "upload_time": "2025-01-05 15:09:49.557887 UTC",
        "filename": "cryptodatahub-1.0.0.tar.gz",
        "size": "579386",
        "path": "12/26/2ef861c3db8180eaf3f96e8edcc02c6f3a640e01feefb452c0ca0e8b4a2d/cryptodatahub-1.0.0.tar.gz",
        "python_version": "source",
        "packagetype": "sdist",
        "has_signature": false,
        "md5_digest": "4c1e915c5eab01a022cda64e991a1e95",
        "sha256_digest": "a4fe31b83e29035ffe4ab35918bc43a87fb522696b8a78d6e7290e22bef85a09",
        "blake2_256_digest": "12262ef861c3db8180eaf3f96e8edcc02c6f3a640e01feefb452c0ca0e8b4a2d",
        "license_files": [],
        "rn": "1",
        "home_page": null,
        "download_url": null
    },
    {
        "metadata_version": null,
        "name": "CryptoFuzz",
        "version": "18.6.0",
        "summary": "Generated and Converted Keys with any Type Foundation from Private Key [WIF Hexed Mnemonic and Binary Bytes seed] in Python",
        "description": "<div style=\"display: flex; justify-content: space-between; align-items: center;\">\n\n\n<img src=\"https://raw.githubusercontent.com/Pymmdrza/cryptoFuzz/gh-pages/doc/img/cryptoFuzz_Logo.png\" title=\"Cryptofuzz / Generated and Converted Private and Public Key Very Easy On Python With cryptofuzz\" alt=\"cryptofuzz python cryptography library\" width=\"136\" height=\"136\"> \n\n</div> \n\n# CryptoFuzz\n\n[![Read the Docs](https://img.shields.io/readthedocs/cryptofuzz)](https://cryptofuzz.readthedocs.io/en/latest 'cryptofuzz documentation') [![GitHub Actions Workflow Status](https://img.shields.io/github/actions/workflow/status/Pymmdrza/cryptoFuzz/python-publish.yml)](https://github.com/Pymmdrza/cryptoFuzz) [![GitHub commit check runs](https://img.shields.io/github/check-runs/Pymmdrza/cryptoFuzz/main)](https://github.com/Pymmdrza/cryptoFuzz)  [![GitHub last commit](https://img.shields.io/github/last-commit/Pymmdrza/cryptoFuzz)](https://github.com/Pymmdrza/cryptoFuzz)  [![GitHub commit activity](https://img.shields.io/github/commit-activity/m/Pymmdrza/cryptoFuzz)](https://github.com/Pymmdrza/cryptoFuzz)  [![GitHub top language](https://img.shields.io/github/languages/top/Pymmdrza/cryptoFuzz)](https://github.com/Pymmdrza/cryptoFuzz)  [![PyPI - Downloads](https://img.shields.io/pypi/dm/cryptoFuzz)](https://pypi.org/project/cryptofuzz/)  [![Website](https://img.shields.io/website?url=https%3A%2F%2Fcryptofuzz.readthedocs.io&up_color=blue&style=plastic)](https://cryptofuzz.readthedocs.io/en/latest)\n\n\n## Installing & Quick Use\n\n### Windows\n\nOn Windows, you can install CryptoFuzz using the following pip command:\n\n```bash\npip install --upgrade cryptofuzz\n```\n\n### Linux & Mac\n\nOn Linux and macOS, you should use pip3 for installation:\n\n```bash\npip3 install --upgrade cryptofuzz\n```\n\n### Git\n\nTo use the latest version from the source, you can clone the CryptoFuzz repository:\n\n1. Clone the repository:\n\n```bash\ngit clone https://github.com/Pymmdrza/cryptofuzz\n```\n\n2. Navigate to the cloned directory:\n\n```bash\ncd cryptofuzz\n```\n\n3. Install the package:\n\n### Windows\n\nYou can either run the `install.bat` or `install` command:\n\n```bash\n./install.bat\n# or\n./install\n```\n\n### Linux & Mac\n\nOn Linux and Mac, you can use the following commands to install:\n\n```bash\nbash install.sh\n# or simply:\n./install.sh\n```\n\n**Note:** If you face any permission issues on Linux, make the script executable using:\n\n```bash\nsudo chmod +x install.sh\n```\n---\n\n[![](https://img.shields.io/badge/%20Update%20at-2024.09.28-009848?style=plastic)]() \n[![](https://img.shields.io/badge/More%20Detail-0049AB?style=plastic)](https://cryptofuzz.readthedocs.io/en/latest/ton/ 'cryptoFuzz - Ton')\n\nAdd New Class For Generate and Convert TON Address.\n\n- `cryptofuzz.Ton`\n- `cryptofuzz.Ton.privatekey_to_address`\n- `cryptofuzz.Ton.mnemonic_to_address`\n- `cryptofuzz.Ton.decimal_to_address`\n- `cryptofuzz.Ton.publickey_to_address`\n- `cryptofuzz.Ton.raw_address`\n\n---\n\n[![](https://img.shields.io/badge/%20Update%20at-2024.09.16-009848?style=plastic)]() \n[![](https://img.shields.io/badge/More%20Detail-0049AB?style=plastic)](https://cryptofuzz.readthedocs.io/en/latest/tron/ 'cryptoFuzz - Tron')\n\nAdd Function for Convert Private Key To Hex Address\nTRON :\n\n- `cryptofuzz.hd.Tron.bytes_to_addr`\n- `cryptofuzz.hd.Tron.bytes_to_hex_addr`\n- `cryptofuzz.hd.Tron.pvk_to_hex_addr`\n\nAdd Function for Convert Decimal Number to Tron\nAddress :\n\n- `cryptofuzz.hd.Tron.dec_to_addr`\n\n---\n\n\n[![](https://img.shields.io/badge/%20Update%20at-2024.09.07-009848?style=plastic)]() \n\nAdd Function for checking mnemonic standard type :\n\n- `cryptofuzz.utils.is_mnemonic`\n\n```python\nfrom cryptofuzz import Convertor\n\ncn = Convertor()\nisValid = cn.is_mnemonic(\"abandon ... help abandon flower\")  # Mnemonic 12/18/24\n```\n\n---\n\n\n[![](https://img.shields.io/badge/%20Update%20at-2024.08.24-009848?style=plastic)]() \n\n\nAdd Short Key (Mini Private Key) Converter for bitcoin wallet. (Mini Private\nKey : [More Detail's](https://en.bitcoin.it/wiki/Mini_private_key_format))\n\nShort Key Like: `S6c56bnXQiBjk9mqSYE7ykVQ7NzrRy`\n\n- Convert Short Key To Private Key (hex).\n- Convert Short Key To Seed (bytes)\n- Convert Short Key To Wif Compress and Uncompress.\n- Convert Short Key To Decimal Number.\n\n---\n\n- More example follow : [Example/Source](https://github.com/Pymmdrza/cryptoFuzz/tree/main/Example)\n- [Convert Private key To Bitcoin (All Format) Address With Cryptofuzz](https://guide.mmdrza.com/guidelines/cryptofuzz/private-key-to-bitcoin 'Private key To Bitcoin (All Format) Address')\n- [Convert Private key To Ethereum Address With Cryptofuzz](https://guide.mmdrza.com/guidelines/cryptofuzz/private-key-to-ethereum 'Private key To Ethereum Address')\n- [Convert Private key To TRON (TRX) Address With Cryptofuzz](https://guide.mmdrza.com/guidelines/cryptofuzz/private-key-to-tron-trx 'Private key To TRON (TRX) Address')\n- [Convert Private key To Dogecoin Address With Cryptofuzz](https://guide.mmdrza.com/guidelines/cryptofuzz/private-key-to-dogecoin 'Private key To Dogecoin Address')\n- [Convert Private key To Litecoin Address With Cryptofuzz](https://guide.mmdrza.com/guidelines/cryptofuzz/private-key-to-litecoin 'Private key To Litecoin Address ')\n- [Convert Private key To Digibyte Address With Cryptofuzz](https://guide.mmdrza.com/guidelines/cryptofuzz/private-key-to-digibyte 'Private key To Digibyte')\n- [Convert Private key To DASH Address With Cryptofuzz](https://guide.mmdrza.com/guidelines/cryptofuzz/private-key-to-dash 'Private key To DASH')\n- [Convert Private key To Bitcoin Gold (BTG) Address With Cryptofuzz](https://guide.mmdrza.com/guidelines/cryptofuzz/private-key-to-bitcoin-gold 'Private key To Bitcoin Gold')\n- [Convert Private key To Ravencoin (rvn) Address With Cryptofuzz](https://guide.mmdrza.com/guidelines/cryptofuzz/private-key-to-ravencoin 'Private key To Ravencoin (rvn) Address')\n\n---\n\n## Private Key\n\nMore details about private key convert in python with\ncryptofuzz : [cryptofuzz/Example/Privatekey](https://guide.mmdrza.com/guidelines/cryptofuzz/example/private-key-hex 'cryptofuzz private key hex source code python')\n\n```python\nfrom cryptofuzz import Convertor, Generator\n\n# // Convertor and Generator Shortcut\nconv = Convertor()\ngen = Generator()\n# // Generate private key\nprivatekey = gen.generate_private_key()\n# // Convert private key To bytes\nseed = conv.hex_to_bytes(privatekey)\n# // Convert private key To mnemonic\nmnemonic = conv.hex_to_mne(privatekey)\n# // Convert private key To wif compress\nwif_compress = conv.hex_to_wif(privatekey, True)\n# // Convert private key To wif uncompress\nwif_uncompress = conv.hex_to_wif(privatekey, False)\n# // Convert private key To decimal number\ndec = conv.hex_to_int(privatekey)\n# // Convert private key To binary\nbinary_str = conv.hex_to_binary(privatekey)\n# // Convert private key To xprv\nxprv = conv.hex_to_xprv(privatekey)\n# // Convert private key To xpub\nxpub = conv.hex_to_xpub(privatekey)\n# // Convert private key To compress address\ncompress_address = conv.hex_to_addr(privatekey, True)\n# // Convert private key To uncompress address\nuncompress_address = conv.hex_to_addr(privatekey, False)\n```\n\n## Wif\n\nConvert From\nWif ( [More detail and Example](https://guide.mmdrza.com/guidelines/cryptofuzz/example/private-key-wif 'more detail wif convert with cryptofuzz') )\n\n```python\nimport os\nfrom cryptofuzz import Convertor\n\nconv = Convertor()\n\n# // generate byte\nbyte = os.urandom(32)\n# // convert Byte To wif\nwif = conv.bytes_to_wif(byte)\n# // wif to mnemonic\nmnemonic = conv.wif_to_mne(wif)\n# // Convert Wif To Hex\nprivatekey = conv.wif_to_hex(wif)\n# // Convert bytes To WIF Uncompress\nwif_uncompress = conv.bytes_to_wif(byte, False)\n# // Convert Wif To Decimal Number\ndec = conv.wif_to_int(wif)\n# // Convert Wif To Binary\nbinary_str = conv.wif_to_binary(wif)\n# // Convert Wif To xprv\nxprv = conv.wif_to_xprv(wif)\n# // Convert Wif To xpub\nxpub = conv.wif_to_xpub(wif)\n# // Convert Wif To compress address\ncompress_address = conv.wif_to_addr(wif, True)\n# // Convert Wif To uncompress address\nuncompress_address = conv.wif_to_addr(wif, False)\n\n```\n\n## Mnemonic\n\nConvert From Mnemonic (BIP39) ( [More Detail](https://guide.mmdrza.com/guidelines/cryptofuzz/example/mnemonic) )\n\n```python\nfrom cryptofuzz import Convertor, Generator\n\nconv = Convertor()\ngen = Generator()\n\n# Generate Mnemonic\nmnemonic = gen.generate_mnemonic(12)\n# Convert Mnemonic To Seed Bytes\nseed = conv.mne_to_bytes(mnemonic)\n# Convert Mnemonic To Hex\nprivatekey = conv.mne_to_hex(mnemonic)\n# Convert Mnemonic To WIF Compress\nwif_compress = conv.mne_to_wif(mnemonic, True)\n# Convert Mnemonic To WIF Uncompress\nwif_uncompress = conv.mne_to_wif(mnemonic, False)\n# Convert Mnemonic To Decimal Number\ndec = conv.mne_to_int(mnemonic)\n# Convert Mnemonic To Binary\nbinary_str = conv.mne_to_binary(mnemonic)\n# Convert Mnemonic To xprv\nxprv = conv.mne_to_xprv(mnemonic)\n# Convert Mnemonic To xpub\nxpub = conv.mne_to_xpub(mnemonic)\n# Convert Mnemonic To compress address\ncompress_address = conv.mne_to_addr(mnemonic, True)\n# Convert Mnemonic To uncompress address\nuncompress_address = conv.mne_to_addr(mnemonic, False)\n```\n\n---\n\n## Decimal\n\nConvert From Decimal (Number) ( [More Detail](https://guide.mmdrza.com/guidelines/cryptofuzz/example/decimal) )\n\n```python\nfrom cryptofuzz import Convertor, Generator\n\nconv = Convertor()\ngen = Generator()\n\n# generate random number decimal\ndec = gen.generate_decimal()\n# decimal to mnemonic\nmnemonic = conv.int_to_mnemonic(dec)\n# Convert decimal To Hex\nprivatekey = conv.int_to_hex(dec)\n# Convert decimal To WIF Compress\nwif_compress = conv.int_to_wif(dec, True)\n# Convert decimal To WIF Uncompress\nwif_uncompress = conv.int_to_wif(dec, False)\n# Convert Wif To Binary\nbinary_str = conv.int_to_binary(dec)\n# Convert Wif To xprv\nxprv = conv.int_to_xprv(dec)\n# Convert Wif To xpub\nxpub = conv.int_to_xpub(dec)\n# Convert Wif To compress address\ncompress_address = conv.int_to_addr(dec, True)\n# Convert Wif To uncompress address\nuncompress_address = conv.int_to_addr(dec, False)\n\n```\n\n---\n\n## Block\n\nread block data from block file (bitcoin core sync data file's) [ `blk00001.dat` ]\n\n```python\nfrom cryptofuzz import block\nimport os\n\n# path block file\npath_data = os.path.join(\"BITCOIN_CORE_SYNC_BLOCK_FOLDER\")\nblock_path = os.path.join(path_data, \"blk00001.dat\")  # first block file sync\n# full block data\nblock_data = block.reader(block_path) \n```\n\n---\n\n## Command-Line Usage\n\nAfter installing the `cryptofuzz` package, you can use the `cryptofuzz` command-line tool to perform various\ncryptographic operations directly from your terminal.\n\n### Examples\n\nHere are some examples demonstrating how to use the `cryptofuzz` command-line tool:\n\n### Generate a New Private Key\n\n```bash\ncryptofuzz --privatekey\n```\n\n**Output:**\n\n```\nGenerating a new private key...\nPrivate Key (Hex): 0x1e99423a4ed27608a15a2616c1...\nWIF: L5BmW3B5xBv...\nPublic Key: 04a34b...\nBitcoin Address (P2PKH): 1BoatSLRHtKNngkdXEeobR76b53LETtpyT\nEthereum Address: 0x742d35Cc6634C0532925a3b844Bc454e4438f44e\n...\n```\n\n### Generate a New Mnemonic Phrase\n\n```bash\ncryptofuzz --mnemonic\n```\n\n**Output:**\n\n```\nGenerating a new mnemonic phrase...\nMnemonic: abandon amount liar amount expire adjust cage candy arch gather drum buyer\nSeed: 5eb00bbddcf069084889a8ab9155568165f5c0...\nPrivate Key: 0x8f2a559490...\nPublic Key: 04bfcab...\nBitcoin Address (P2PKH): 1HZwkCg...\nEthereum Address: 0xAb5801a7...\n```\n\n### Convert Private Key to Bitcoin Addresses\n\n```bash\ncryptofuzz --bitcoin\n```\n\n**Output:**\n\n```\nConverting private key to Bitcoin addresses...\nPrivate Key (Hex): 0x1e99423a4ed27608a15a2616c1...\nP2PKH Address: 1BoatSLRHtKNngkdXEeobR76b53LETtpyT\nP2SH Address: 3J98t1WpEZ73CNmQviecrnyiWrnqRhWNLy\nBech32 Address: bc1qw508d6qejxtdg4y5r3zarvary0c5xw7kygt080\n```\n\n### Display Example Usages\n\n```bash\ncryptofuzz --example\n```\n\n**Output:**\n\n```\nCryptofuzz Usage Examples:\n\n1. Generate a new private key:\n   cryptofuzz --privatekey\n\n2. Generate a new mnemonic phrase:\n   cryptofuzz --mnemonic\n\n3. Convert a private key to Ethereum address:\n   cryptofuzz --ethereum\n\n4. Display help information:\n   cryptofuzz --help\n```\n\n### Handling Incorrect Commands\n\nIf you enter an incorrect or unsupported command, `cryptofuzz` will suggest the closest matching command or prompt you\nto view the help documentation.\n\n**Example:**\n\n```bash\ncryptofuzz --bitcon\n```\n\n**Output:**\n\n```bash\nUnknown command '--bitcon'.\nDid you mean '--bitcoin'?\nFor a list of available commands, type: cryptofuzz --help\n```\n\n### Display Help Information\n\nTo view detailed help information about all available commands, use the `--help` flag:\n\n```bash\ncryptofuzz --help\n```\n\n**Output:**\n\nusage: `cryptofuzz [OPTIONS]`\n\n### Example Cryptofuzz Operations\n\noptional arguments:\n\n- `-h`, `--help`            show this help message and exit\n- `-p`, `--privatekey`      Generate a new private key and display associated data.\n- `-m`, `--mnemonic`        Generate a new mnemonic phrase and display associated data.\n- `-b`, `--bytes`           Generate a random byte sequence and display associated data.\n- `-bin`,` --binary`        Generate a random binary string and display associated data.\n- `-x`, `--xprv`            Generate a new extended private key (XPRV) and display associated data.\n- `-d`, `--decimal`         Generate a random decimal number and display associated data.\n- `-w`, `--wif`             Generate a new WIF key and display associated data.\n- `-btc`, `--bitcoin`       Convert a private key to Bitcoin addresses.\n- `-eth`, `--ethereum`      Convert a private key to an Ethereum address.\n- `-dash`, `--dash`         Convert a private key to a Dash address.\n- `-ltc`, `--litecoin`      Convert a private key to Litecoin addresses.\n- `-doge`, `--dogecoin`     Convert a private key to a Dogecoin address.\n- `-btg`, `--bitcoingold`   Convert a private key to a Bitcoin Gold address.\n- `-qtum`, `--qtum `        Convert a private key to a Qtum address.\n- `-zcash`, `--zcash `      Convert a private key to a Zcash address.\n- `-rvn`, `--ravencoin`     Convert a private key to a Ravencoin address.\n- `-ex`, `--example`        Display example usages of different commands.\n\n---\n\n### contact\n\nProgrammer & Owner : Mr. [PyMmdrza](https://github.com/Pymmdrza)\n\nEmail : PyMmdrza@Gmail.Com\n\nGithub: [cryptofuzz/cryptofuzz](https://github.com/Pymmdrza/cryptoFuzz)\n\nDocument: [cryptofuzz](https://pymmdrza.github.io/cryptoFuzz)\n\n---\n\n### Donate:\n\nBitcoin (BTC): `1MMDRZA12xdBLD1P5AfEfvEMErp588vmF9`\n\nEthereum & USDT (ERC20): `0x348e3C3b17784AafD7dB67d011b85F838F16E2D1`\n\nUSDT & TRON (TRC20): `TR4mA5quGVHGYS186HKDuArbD8SVssiZVx`\n\nLitecoin (LTC): `ltc1qtgvxc6na9pxvznu05yys3j5rq9ej6kahe2j50v`\n",
        "description_content_type": "text/markdown",
        "license": "MIT",
        "keywords": "CryptoFuzz, Wif, Mnemonic, Binary, seed, Foundation, Private, Key, HEX, Mnemonic, Binary, Bytes, bitcoin, ethereum, tron, dogecoin, zcash, digibyte, bitcoin gold, wallet, bip32, bip39, litecoin, qtum, ravencoin, BTC, ETH, TRX, DOGE, BTG, LTC, ZEC, AXE, DASH",
        "classifiers": [
            "Development Status :: 5 - Production/Stable",
            "Intended Audience :: Developers",
            "Intended Audience :: Information Technology",
            "License :: OSI Approved :: MIT License",
            "Operating System :: OS Independent",
            "Programming Language :: Python :: 3",
            "Programming Language :: Python :: 3.10",
            "Programming Language :: Python :: 3.11",
            "Programming Language :: Python :: 3.6",
            "Programming Language :: Python :: 3.7",
            "Programming Language :: Python :: 3.8",
            "Programming Language :: Python :: 3.9",
            "Programming Language :: Python :: Implementation :: CPython",
            "Topic :: Security :: Cryptography"
        ],
        "platform": [],
        "requires_python": null,
        "requires": [],
        "provides": [],
        "obsoletes": [],
        "requires_dist": [
            "hdwallet",
            "ecdsa"
        ],
        "provides_dist": [],
        "obsoletes_dist": [],
        "requires_external": [],
        "project_urls": [
            "Bug Tracker",
            "Documentation",
            "Source Code",
            "Website"
        ],
        "uploaded_via": "twine/6.0.1 CPython/3.12.7",
        "upload_time": "2024-12-08 02:49:29.880909 UTC",
        "filename": "cryptofuzz-18.6.0.tar.gz",
        "size": "48993",
        "path": "40/95/9f3f6c904256f0481e5b0c3ccbfa656f2826876eeb5cfead4a9885314238/cryptofuzz-18.6.0.tar.gz",
        "python_version": "source",
        "packagetype": "sdist",
        "has_signature": false,
        "md5_digest": "426e9dbfdfb0fc07904782f73e47c69c",
        "sha256_digest": "8907dd5fbe92d971b89a6f8f5e6fb9413d38757a50fc3dfbf990725ee3129b6f",
        "blake2_256_digest": "40959f3f6c904256f0481e5b0c3ccbfa656f2826876eeb5cfead4a9885314238",
        "license_files": [],
        "rn": "1",
        "home_page": "https://github.com/Pymmdrza/cryptoFuzz",
        "download_url": null
    },
    {
        "metadata_version": null,
        "name": "CryptoLyzer",
        "version": "1.0.0",
        "summary": "A comprehensive cryptographic settings analyzer",
        "description": ".. image:: https://gitlab.com/coroner/cryptolyzer/badges/master/pipeline.svg\n    :alt:  Pipeline\n    :target: https://gitlab.com/coroner/cryptolyzer/-/pipelines/master/latest\n.. image:: https://coveralls.io/repos/gitlab/coroner/cryptolyzer/badge.svg?branch=master\n    :alt:  Test Coverage\n    :target: https://coveralls.io/gitlab/coroner/cryptolyzer/\n.. image:: https://readthedocs.org/projects/cryptolyzer/badge/?version=latest\n    :alt:  Documentation\n    :target: https://cryptolyzer.readthedocs.io\n\n**CryptoLyzer** is a fast, flexible, and comprehensive server cryptographic protocol\n(`TLS <https://en.wikipedia.org/wiki/Transport_Layer_Security>`__,\n`SSL <https://en.wikipedia.org/wiki/Transport_Layer_Security#SSL_1.0,_2.0,_and_3.0>`__,\n`SSH <https://en.wikipedia.org/wiki/Secure_Shell>`__,\n`DNSSEC <https://en.wikipedia.org/wiki/Domain_Name_System_Security_Extensions>`__) and related setting\n(`HTTP headers <https://en.wikipedia.org/wiki/List_of_HTTP_header_fields>`__,\n`DNS records <https://en.wikipedia.org/wiki/List_of_DNS_record_types>`__) analyzer and fingerprint\n(`JA3 <https://engineering.salesforce.com/tls-fingerprinting-with-ja3-and-ja3s-247362855967>`__,\n`HASSH <https://engineering.salesforce.com/open-sourcing-hassh-abed3ae5044c/>`__ tag) generator with\n`application programming <https://en.wikipedia.org/wiki/API>`__ (API) and\n`command line <https://en.wikipedia.org/wiki/Command-line_interface>`__ (CLI) interface.\n\nHowever the API can provide the most complete functionality, the CLI also strives to be as comprehensive as possible. To\ndo that CLI provides three output formats. The first one for human analysis where the cryptographic algorithm names and\nthe values of key sizes and other security-related settings are colorized according to their security strength using the\nwell-known `traffic light rating system <https://en.wikipedia.org/wiki/Traffic_light_rating_system>`__. The other two\noutput formats (`Markdown <https://en.wikipedia.org/wiki/Markdown>`__, `JSON <https://en.wikipedia.org/wiki/JSON>`__)\nare machine-readable, however the Markdown format even human-readable and even suitable for generating documentation in\ndifferent formats (e.g. DOCX, PDF, ...).\n\nThe strength of CryptoLyzer compared to its competitors is that it contains a custom implementation of cryptographic\nprotocols (`CryptoParser <https://cryptoparser.readthedocs.io>`__), which are as small as absolutely necessary for the\nanalysis, but as most comprehensive algorithm identifier sets of the cryptographic protocols\n(`CryptoDataHub <https://cryptodatahub.readthedocs.io>`__) as possible. The combination of the two properly makes it\npossible to check the support of rarely used, deprecated, non-standard, or experimental algorithms and methods that are\nnot yet or have never been supported by the most popular cryptographic algorithms. This way of working leads to the fact\nthat CryptoLyzer can recognize more TLS cipher suites than listed in total on\n`Ciphersuite Info <https://ciphersuite.info/cs/>`__.\n\n-----\nUsage\n-----\n\nPip\n===\n\n.. code:: shell\n\n   pip install cryptolyzer\n\n   cryptolyze tls all www.example.com\n   cryptolyze tls1_2 ciphers www.example.com\n   cryptolyze ssh2 ciphers www.example.com\n   cryptolyze http headers www.example.com\n   cryptolyze dns dnssec example.com\n\nDocker\n======\n\n.. code:: shell\n\n   docker run --rm coroner/cryptolyzer tls all www.example.com\n   docker run --rm coroner/cryptolyzer tls1_2 ciphers www.example.com\n   docker run --rm coroner/cryptolyzer ssh2 ciphers www.example.com\n   docker run --rm coroner/cryptolyzer http headers www.example.com\n   docker run --rm coroner/cryptolyzer dns dnssec example.com\n\n.. code:: shell\n\n   docker run -ti --rm -p 127.0.0.1:4433:4433 coroner/cryptolyzer ja3 generate 127.0.0.1:4433\n   openssl s_client -connect 127.0.0.1:4433\n\n   docker run -ti --rm -p 127.0.0.1:2121:2121 coroner/cryptolyzer ja3 generate ftp://127.0.0.1:2121\n   openssl s_client -starttls ftp -connect 127.0.0.1:2121\n\n.. code:: shell\n\n   docker run -ti --rm -p 127.0.0.1:2222:4433 coroner/cryptolyzer hassh generate 127.0.0.1:2222\n   openssl s_client -connect 127.0.0.1:2222\n\n-------\nSupport\n-------\n\nPython implementation\n=====================\n\n-  CPython (3.9+)\n-  PyPy (3.9+)\n\nOperating systems\n=================\n\n-  Linux\n-  macOS\n-  Windows\n\n------------\nSocial Media\n------------\n\n-  `Twitter <https://twitter.com/CryptoLyzer>`__\n-  `Facebook <https://www.facebook.com/cryptolyzer>`__\n\n-------------\nDocumentation\n-------------\n\nDetailed `documentation <https://cryptolyzer.readthedocs.io>`__ is available on the project's\n`Read the Docs <https://readthedocs.com>`__ site.\n\n-------\nLicense\n-------\n\nThe `code <https://gitlab.com/coroner/cryptolyzer>`__ is available under the terms of\n`Mozilla Public License Version 2.0 <https://www.mozilla.org/en-US/MPL/2.0/>`__ (MPL 2.0).\n\nA non-comprehensive, but straightforward description of MPL 2.0 can be found at\n`Choose an open source license <https://choosealicense.com/licenses#mpl-2.0>`__ website.\n\n-------\nCredits\n-------\n\n-  `NLnet Foundation <https://nlnet.nl>`__ and `NGI Assure <https://www.assure.ngi.eu>`__, supports the project part of\n   the `Next Generation Internet <https://ngi.eu>`__ initiative.\n-  Icons made by `Freepik <https://www.flaticon.com/authors/freepik>`__ from `Flaticon <https://www.flaticon.com/>`__.\n",
        "description_content_type": "text/x-rst",
        "license": "MPL-2.0",
        "keywords": "ssl, tls, gost, ja3, hassh, https, pop3, smtp, imap, ftp, rdp, xmpp, jabber, ldap, sieve, ssh, hsts, dnssec",
        "classifiers": [
            "Development Status :: 5 - Production/Stable",
            "Environment :: Console",
            "Framework :: tox",
            "Intended Audience :: Developers",
            "Intended Audience :: Information Technology",
            "Intended Audience :: Science/Research",
            "Intended Audience :: System Administrators",
            "License :: OSI Approved :: Mozilla Public License 2.0 (MPL 2.0)",
            "Natural Language :: English",
            "Operating System :: MacOS",
            "Operating System :: Microsoft :: Windows",
            "Operating System :: POSIX",
            "Programming Language :: Python",
            "Programming Language :: Python :: 3.10",
            "Programming Language :: Python :: 3.11",
            "Programming Language :: Python :: 3.12",
            "Programming Language :: Python :: 3.13",
            "Programming Language :: Python :: 3.9",
            "Programming Language :: Python :: Implementation :: CPython",
            "Programming Language :: Python :: Implementation :: PyPy",
            "Topic :: Internet",
            "Topic :: Internet :: File Transfer Protocol (FTP)",
            "Topic :: Internet :: XMPP",
            "Topic :: Security",
            "Topic :: Security :: Cryptography",
            "Topic :: Software Development :: Libraries :: Python Modules",
            "Topic :: Software Development :: Testing",
            "Topic :: Software Development :: Testing :: Traffic Generation"
        ],
        "platform": [],
        "requires_python": null,
        "requires": [],
        "provides": [],
        "obsoletes": [],
        "requires_dist": [
            "attrs",
            "bs4",
            "certvalidator",
            "colorama",
            "cryptoparser==1.0.0",
            "pyfakefs",
            "python-dateutil",
            "requests",
            "dnspython",
            "urllib3"
        ],
        "provides_dist": [],
        "obsoletes_dist": [],
        "requires_external": [],
        "project_urls": [
            "Changelog",
            "Documentation",
            "Homepage",
            "Issues",
            "Source"
        ],
        "uploaded_via": "twine/6.0.1 CPython/3.13.1",
        "upload_time": "2025-01-11 19:52:36.065388 UTC",
        "filename": "cryptolyzer-1.0.0.tar.gz",
        "size": "299071",
        "path": "2b/1d/556b84843f7159f109981d48b4f3d730e10847f7e7ffc46cd88baa919991/cryptolyzer-1.0.0.tar.gz",
        "python_version": "source",
        "packagetype": "sdist",
        "has_signature": false,
        "md5_digest": "fb0f35a9cf8ca5bd1b64280d073d5b14",
        "sha256_digest": "ad189169738d2cc362acab0af90656312bda19e48bac737d06933c761c686b16",
        "blake2_256_digest": "2b1d556b84843f7159f109981d48b4f3d730e10847f7e7ffc46cd88baa919991",
        "license_files": [],
        "rn": "1",
        "home_page": null,
        "download_url": null
    }
]